package learn.zno.znostudy;

import android.content.ContentValues;
import android.content.Intent;
import android.content.SharedPreferences;
import android.os.AsyncTask;
import android.os.Bundle;
import android.view.View;
import android.widget.Toast;

import androidx.annotation.Nullable;
import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;

import learn.zno.znostudy.TotalStats.ChoiseTotalStats;
import learn.zno.znostudy.TotalStats.TotalStat;
import learn.zno.znostudy.db.DBHelpers;
import learn.zno.znostudy.db.DateDb;

public class MainActivity extends AppCompatActivity {

    private static final String firstStartApp = "first_start";

    private long backPressedTime;
    private Toast backToast;

    DBHelpers dbHelpers;
    AlertDialog.Builder builder;
    AlertDialog alert ;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        dbHelpers = new DBHelpers(this);

        SharedPreferences sp = getSharedPreferences(firstStartApp, MODE_PRIVATE);
        boolean firstStart = sp.getBoolean("start", true);
        if(firstStart) {
            sp.edit().putBoolean("start", false).apply();
            builder = new AlertDialog.Builder(this);
            mt = new MyTask();  //TODO Another Thread for loading BD
            mt.execute();
        }
    }

    MyTask mt;

    private class MyTask extends AsyncTask<Void, Void, Void> {

        @Override
        protected void onPreExecute() {
            super.onPreExecute();
            builder.setTitle("Завантаження БД");
            builder.setCancelable(false);
            builder.setMessage("Зачекайте, будь ласка, поки триває завантаження бази даних. Не закривайте додаток.");
            alert = builder.create();
            alert.show(); // Show Alert Dialog

        }

        @Override
        protected Void doInBackground(Void... params) {
            InsertDate(); // Load Bd Date
            return null;
        }

        @Override
        protected void onPostExecute(Void result) {
            super.onPostExecute(result);
            alert.dismiss(); // Cancel Alert Dialog after End load date from DB
            Toast.makeText(MainActivity.this, "Завантаження даних закінчено", Toast.LENGTH_SHORT).show();
        }
    }

    public void Test(View view) {
        Intent intent = new Intent(this,ThemesQuestions.class);
        startActivity(intent);
    }

    public void StatisticaTotal(View view) {
        Intent intent = new Intent(this, ChoiseTotalStats.class);
        startActivity(intent);
    }

    public void ShareFriends(View view) {
        Intent intent = new Intent(Intent.ACTION_SEND);
        intent.setType("text/plain");
        intent.putExtra(Intent.EXTRA_TEXT,"https://play.google.com/store/apps/details?id=learn.zno.znostudy");
        startActivity(intent);
    }


    public void Exit(View view) {
        finish();
    }



    @Override
    public void onBackPressed() {

        if(backPressedTime + 2000 > System.currentTimeMillis()){
            backToast.cancel();
            super.onBackPressed();
            return;
        } else {
            backToast = Toast.makeText(this, "Натисніть ще раз щоб вийти", Toast.LENGTH_SHORT);
            backToast.show();
        }

        backPressedTime = System.currentTimeMillis();
    }

    public void Victoryna(View view) {
        Intent intent = new Intent(this,ChoiseZNOYear.class);
        startActivity(intent);
    }

    public void OneExtra(View view) {
        Intent intent = new Intent(this,OneExtra.class);
        startActivityForResult(intent,3);
    }

    public void TrueFalse(View view) {
        Intent intent = new Intent(this,TrueOrFalse.class);
        startActivityForResult(intent,1);
    }

    public void FindMatch(View view) {
        Intent intent = new Intent(this,FindaMatch.class);
        startActivityForResult(intent,2);
    }

    @Override
    protected void onActivityResult(int requestCode, int resultCode, @Nullable Intent data) {
        if(requestCode == 1) {
            if (data != null && data.getIntExtra("exit", 2) == 1) {
                new AlertDialog.Builder(this)
                        .setTitle("Правда чи Брехня")
                        .setMessage("Ваш результат  - " + data.getIntExtra("score", 0) + "\nКількість правильних відповідей - " + data.getIntExtra("scoreTrue", 0) + "\nКількість не правильних відповідей - " + data.getIntExtra("scoreFalse", 0))
                        .setPositiveButton("Добре", null)
                        .show();
            }
        }
        /*if(requestCode == 2){

        }
        if(requestCode == 3){

        }*/
        super.onActivityResult(requestCode, resultCode, data);
    }

    private void InsertDate(){
        //TODO 2019 main
        dbHelpers.addData(new DateDb(1,"Словами\n" +
                "\n" +
                "Та  нехай мій батько добре дбає,\n" +
                "Ґрунтів, великих маєтків нехай\n" +
                "не збуває,\n" +
                "Великих скарбів не збирає… –\n" +
                "\n" +
                "звертається до козаків","Маруся Богуславка","Олеся Запорожець","Леся Череванівна","Маруся Чурай","Наталка Полтавка"));
        dbHelpers.addData(new DateDb(2,"У рядках\n" +
                "\n" +
                "Бряжчить шабля о шолом,\n" +
                "Тріщать списи гартовані\n" +
                "В степу, в незнаємому полі,\n" +
                "Серед землі Половецької…\n" +
                "\n" +
                "Тарас Шевченко згадує події, зображені у творі","«Слово про похід Ігорів»","«Гайдамаки»","«Енеїда»","«Чорна рада»","«Ой Морозе, Морозенку»"));
        dbHelpers.addData(new DateDb(3,"Слова\n" +
                "\n" +
                "Де общеє добро в упадку,\n" +
                "Забудь отця, забудь і матку,\n" +
                "Лети повинность ісправлять…\n" +
                "\n" +
                "належать персонажу твору","«Енеїда»","«Слово про похід Ігорів»","«Всякому місту – звичáй і права…»","«Повість минулих літ»","«Гайдамаки»"));
        dbHelpers.addData(new DateDb(4,"«Гарно вбрану молодь письменник бачив і в Основі, і в Харкові, а знання творчості народу та реальної дійсності в цих місцях поєдналися й допомогли створити яскраві сентиментальні образи», – сказано про твір, у якому","дівчина йде в ліс по гриби","свекруха сварить невістку","мати хоче видати дочку за гетьмана","дівчина проводжає хлопця на війну","чоловік пише лист дружині"));
        dbHelpers.addData(new DateDb(5,"Cлова 'В своїй хаті - своя правда, і сила, і воля' узяті із твору, де є рядки","«Розкуйтеся, братайтеся, / У чужому краю / Не шукайте, не питайте, Того, що немає…»","«І мене в сім’ї великій, / В сім’ї вольній, новій, / Не забудьте пом’янути Незлим тихим словом…»","«Не журиться Катерина / І гадки не має – / У новенькій хустиночці В вікно виглядає…»","«Чурек і сакля – все твоє; / Воно не прошене, не дане, / Ніхто й не возьме за своє, / Не поведе тебе в кайданах…»","«Все йде, все минає – і краю немає, / Куди ж воно ділось? Відкіля взялось? І дурень, і мудрий нічого не знає…»"));
        dbHelpers.addData(new DateDb(6,"Козацький літопис Самовидця став одним із джерел для написання твору","«Чорна рада»","«Гайдамаки»","«Енеїда»","«Україна в огні»","«Маруся Чурай»"));
        dbHelpers.addData(new DateDb(7,"«Ставте, тату, мерщій хату через сіни…» – вимагає персонаж","соціально-побутової повісті","соціально-побутової драми","пригодницького роману","усмішки","комедії"));
        dbHelpers.addData(new DateDb(8,"У творі «Хіба ревуть воли, як ясла повні?» порушено проблему","«пропащої сили»","служіння митця народові","«сродної праці»","взаємин вождя і народу","формування національної еліти"));
        dbHelpers.addData(new DateDb(9,"Афоризм Григорія Сковороди «Потрібно тільки пізнати себе, хто для чого народжений. Краще бути натуральним котом, ніж з ослиною природою левом» суголосний з головною думкою твору","«Мартин Боруля»","«Хіба ревуть воли, як ясла повні?»","«Сон» («У всякого своя доля…»)","«Кайдашева сім’я»","«Мойсей»"));
        dbHelpers.addData(new DateDb(10,"Дух, наука, думка, воля –\n" +
                "Не уступить пітьмі поля.\n" +
                "Не дасть спутатись тепер…\n" +
                "\n" +
                "– переконаний ліричний герой твору","Івана Франка","Володимира Сосюри","Тараса Шевченка","Олександра Олеся","Миколи Зерова"));
        dbHelpers.addData(new DateDb(11,"Переліком дійових осіб починається твір, який має присвяту","кононівським полям","любові всевишній","«Цвітові яблуні»","своєму батькові Юліанові Я. Кобилянському","Якову де Бальмену"));
        dbHelpers.addData(new DateDb(12,"«Сусідній» ліс, теля, місяць і зорі – це образи-символи твору, у якому змальовано життя родини","Федорчуків","Боруль","Мазайлів","Кайдашів","Запорожців"));
        dbHelpers.addData(new DateDb(13,"Послідовність розгортання подій твору «Лісова пісня» дотримано в рядку","Лукашева сопілка будить Мавку – Килина з Лукашем жнуть жито – Марище забирає Мавку – зустріч Лукаша із загубленою Долею","Килина з Лукашем жнуть жито – Марище забирає Мавку – Лукашева сопілка будить Мавку – зустріч Лукаша із загубленою Долею","Марище забирає Мавку – зустріч Лукаша із загубленою Долею – Лукашева сопілка будить Мавку – Килина з Лукашем жнуть жито","Лукашева сопілка будить Мавку – Марище забирає Мавку – Килина з Лукашем жнуть жито – зустріч Лукаша із загубленою Долею","Лукашева сопілка будить Мавку – зустріч Лукаша із загубленою Долею – Килина з Лукашем жнуть жито – Марище забирає Мавку"));
        dbHelpers.addData(new DateDb(14,"Представнику «розстріляного відродження» належать рядки","І в наші дні зберіг ти чар-отруту: В тобі розбили табір аспанфути…","Ні ж бо, не злотне; зрівнявши все злото\n" +
                "Проти свободи воно лиш болото...","Хоч знаєш, знаєш, добре знаєш, \n" +
                "Як я люблю тебе без тями…","Може, квіти зійдуть – і настане\n" +
                "Ще й для мене весела весна…","Все повторялось: і краса, й потворність.\n" +
                "Усе було: асфальти й спориші…"));
        dbHelpers.addData(new DateDb(15,"Драматичними за родовою ознакою є обидва твори в рядку","«Наталка Полтавка» та «Мина Мазайло»","«Бджола та Шершень» та «Гайдамаки»","«Intermezzo» та «Україна в огні»","«Лісова пісня» та «Я (Романтика)»","«Залізний острів» та «Мартин Боруля»"));
        dbHelpers.addData(new DateDb(16,"У рядках\n" +
                "\n" +
                "Кленусь тобі, веселий світе,\n" +
                "Кленусь тобі, моє дитя.\n" +
                "Що буду жити, поки жити\n" +
                "Мені дозволить дух життя!\n" +
                "\n" +
                "провідним художнім засобом є","анафора","антитеза","порівняння","гіпербола","алегорія"));
        dbHelpers.addData(new DateDb(17,"«\u200BІ мрії про можливість наскоком здобути місце в міській машині зараз здавались йому самому дитячими. Він тлумачив сам собі – треба скласти іспит, добути стипендію й учитись, а решта все прикладеться...» – сказано про","Степана Радченка","Петра Шраменка","Степана Борулю","Михайла Федорчука","Мокія Мазайла"));
        dbHelpers.addData(new DateDb(18,"Євген Маланюк є автором рядків","«Не кинувши у глиб надійний якір, / Пливу й пливу повз береги краси…»","«Понад все вони любили / Свій коханий край…»","«Одійдіте, недруги лукаві!.. / Друзі, зачекайте на путі!..»","«Прийшли лемки у крисанях / і принесли місяць круглий...»","«Як син, тобі доземно уклонюсь / і чесно гляну в чесні твої вічі…»"));
        dbHelpers.addData(new DateDb(19,"У рядках\n" +
                "\n" +
                "Я знаю, дід та баба – це коли є онуки,\n" +
                "а в них сусідські діти шовковицю їдять\n" +
                "\n" +
                "сказано про","самотність старшого покоління","щасливе подружнє життя","активне життя стареньких","неможливість існування без праці","сум за далеким дитинством"));
        dbHelpers.addData(new DateDb(20,"Характерні риси постмодернізму відчутні в рядках","«Ми, й невтямки нікому з нас, нікому, / Що зовсім не на білому коні, / І навіть не на іншому якому,– / На BMW або на БМП / Зима влетить по вимерзлій шосейці…»","«Дорога і дорога лежить за гарбузами. / І хтось до когось їде тим шляхом золотим. / Остання в світі казка сидить під образами…»","«Там дивний ліс зітхає ароматом / І весь дзвенить од гімнів п’яних птиць, / Співа трава, ніким ще не зім’ята, / І вабить сном солодких таємниць…»","«Красиве, засмагле сонце / В золотих переливах кучерів, / У червоній сорочці навипуск, / Що їхало на велосипеді, / Обминаючи хмари у небі…»","«Де дня розгойдані тарілі? / Мосянжний перегуд джмелів, / твої пшеничні руки білі / над безберегістю полів…»"));

        //TODO 2019 additional
        dbHelpers.addData(new DateDb(21,"Рядки\n" +
                "\n" +
                "Така її доля… О Боже мій милий!\n" +
                "За що ж ти караєш її, молоду?\n" +
                "За те, що так щиро вона полюбила\n" +
                "Козацькії очі?..\n" +
                "\n" +
                "суголосні з життєвими обставинами ліричного героя твору","«Віють вітри, віють буйні»","«Дума про Марусю Богуславку»","«Блакитна Панна»","«Contra spem spero!»","«Чого являєшся мені...»"));
        dbHelpers.addData(new DateDb(22,"Уривок «Зробили вони городок [і] на честь брата їх найстаршого назвали його Києвом. І був довкола гóрода ліс і бір великий, і ловили вони [тут] звірину. Були ж вони мужами мудрими й тямущими і називалися полянами…» узято з твору","«Повість минулих літ»","«Тигролови»","«Слово про похід Ігорів»","«Тіні забутих предків»","«Україна в огні»"));
        dbHelpers.addData(new DateDb(23,"Рядки\n" +
                "\n" +
                "В тім гóроді жила Дідона,\n" +
                "А гóрод звався Карфаген.\n" +
                "Розумна пані і моторна…\n" +
                "\n" +
                "є у творі","Івана Котляревського","Івана Франка","Тараса Шевченка","Нестора Літописця","Григорія Сковороди"));
        dbHelpers.addData(new DateDb(24,"Уривок «I варивши обiд, i подававши на стiл, Маруся заливалася слiзоньками, вiдгадувавши, певно, що востаннє бачить свого Василечка» містить пестливу лексику, має співчутливий тон розповіді, що характерно для","символізму","реалізму","експресіонізму","сентименталізму","неоромантизму"));
        dbHelpers.addData(new DateDb(25,"У рядках\n" +
                "\n" +
                "Вибачайте, люде добрі,\n" +
                "Що козацьку славу\n" +
                "Так навмання розказую,\n" +
                "Без книжної справи.\n" +
                "Так дід колись розказував,\n" +
                "Нехай здоров буде!..\n" +
                "\n" +
                "автор розповідає історію написання твору","«Гайдамаки»","«Енеїда»","«Кавказ»","«Чорна рада»","«Мойсей»"));
        dbHelpers.addData(new DateDb(26,"«Добрий він, і душа щира, козацька, хоч удає з себе ледащицю і характерника», – сказано про","Кирила Тура","Василя Кравчину","Гриця Бобренка","Григорія Многогрішного","Наума Дрота"));
        dbHelpers.addData(new DateDb(27,"«Безокою економшею» односельці називали героїню твору, у якому","син одружується з дівчиною з іншого села","мати мріє віддати заміж за гетьмана свою дочку","батько стає старостою села під час нацистської окупації","родина дає притулок в’язню-втікачу","дівчина постає перед судом за те, що отруїла козака"));
        dbHelpers.addData(new DateDb(28,"«Двужон», «Дитячі літа», «Хазяїн», «Січовик», «Пани Польські» – це розділи твору, що","має двох авторів","змальовує Гуцульщину","має присвяту батькові автора","змальовує події Коліївщини","описує боротьбу за гетьманську булаву"));
        dbHelpers.addData(new DateDb(29,"Послідовність розгортання подій твору «Мартин Боруля» дотримано в рядку","Мартин Боруля подає апеляцію до суду – Степана виряджають на службу в місто – утеча Націєвського – Мартин Боруля спалює документи","Степана виряджають на службу в місто – Мартин Боруля подає апеляцію до суду – утеча Націєвського – Мартин Боруля спалює документи","Мартин Боруля подає апеляцію до суду – Степана виряджають на службу в місто – Мартин Боруля спалює документи – утеча Націєвського","Мартин Боруля спалює документи – Степана виряджають на службу в місто – Мартин Боруля подає апеляцію до суду – утеча Націєвського","Степана виряджають на службу в місто – Мартин Боруля подає апеляцію до суду – Мартин Боруля спалює документи – утеча Націєвського"));
        dbHelpers.addData(new DateDb(30,"Єгошуа - персонаж твору","«Мойсей»","«Гайдамаки»","«Енеїда»","«Чорна рада»","«Хіба ревуть воли, як ясла повні?»"));
        dbHelpers.addData(new DateDb(31,"У рядках\n" +
                "\n" +
                "В корчах і кручах умирають міфи.\n" +
                "Чугайстер щез. Покаялись нявки\n" +
                "\n" +
                "згадано персонажів твору","«Тіні забутих предків»","«Мойсей»","«Лісова пісня»","«Зачарована Десна»","«Дитинство»"));
        dbHelpers.addData(new DateDb(32,"Уривок «Данилко ніс повні руки трав, і корінців, і квітів; дажкорінь пах солодким хлібом, “ось тобі, Данилку, і степовий турецький сльоз”, – сказав прадід і нахилився до квітки, і раптом підломився в ногах, і розкинув руки, мов обіймаючи землю...» узято з","новели","усмішки","кіноповісті","повісті","драми"));
        dbHelpers.addData(new DateDb(33,"«Світ урятує краса, утілена в гармонії людини й природи, у світлому почутті кохання, у жертовній любові та здатності прощати» – це провідна думка твору","«Лісова пісня»","«Маруся»","«Тигролови»","«Місто»","«Земля»"));
        dbHelpers.addData(new DateDb(34,"«Я візьму той рушник, простелю, наче долю...» – стверджує ліричний герой поезії, у якій є рядок","«І дитинство, й розлука, і вірна любов»","«Ось місяць, зорі, солов’ї»","«Чи забуття, чи зрада»","«Свій біль, свій жаль, свої пісні»","«Людей мільярди і мільярди слів»"));
        dbHelpers.addData(new DateDb(35,"Думка про те, що «малорос – це тип національно-дефективний, скалічений психічно, духовно, а – у наслідках, часом – і расово», є доречною для характеристики","Мини Мазайла","Грицька Бобренка","Чіпки Варениченка","Григорія Многогрішного","Сави Федорчука"));
        dbHelpers.addData(new DateDb(36,"У рядках\n" +
                "\n" +
                "Так ніхто не кохав. Через тисячі літ\n" +
                "лиш приходить подібне кохання…\n" +
                "\n" +
                "провідним художнім засобом є","гіпербола","алегорія","анафора","порівняння","паралелізм"));
        dbHelpers.addData(new DateDb(37,"«Трагічні терези», «дивний ліс», «гіпнотичні кобри», «веселий галас бою» – художні образи з поезії","Євгена Маланюка","Олександра Олеся","Максима Рильського","Миколи Зерова","Василя Симоненка"));
        dbHelpers.addData(new DateDb(38,"Називає Україну матір’ю, пишається цим, заради неї творить і мислить ліричний герой поезії","«Задивляюсь у твої зіниці…»","«Молюсь і вірю. Вітер грає…»","«О земле втрачена, явися!..»","«О слово рідне! Орле скутий!..»","«Українське альфреско»"));
        dbHelpers.addData(new DateDb(39,"Про чистоту кохання, що робить людину сильною, відповідальною за долю інших, про загрозу гонитви озброєнь пише у своєму творі","Олесь Гончар","Остап Вишня","Григір Тютюнник","Микола Куліш","Михайло Коцюбинський"));
        dbHelpers.addData(new DateDb(40,"Ознакою постмодернізму є","химерне переплетення різних стилів","захоплення національною історією","типізація характерів персонажів залежно від умов життя","домінування морально-етичних цінностей","прагнення персонажа до ідеалу"));


        //TODO 2018 main
        dbHelpers.addData(new DateDb(41,"Рядки\n" +
                "\n" +
                "Ця дівчина не просто так, Маруся.\n" +
                "Це – голос наш. Це – пісня. Це – душа\n" +
                "\n" +
                "характеризують автора твору","«Зáсвіт встали козаченьки»","«Ой летіла стріла»","«Чи не той то хміль»","«Ой Морозе, Морозенку»","«Чого являєшся мені у сні?..»"));
        dbHelpers.addData(new DateDb(42,"Із «золотим словом» Святослав звертається до руських князів з метою","закликати до об’єднання в боротьбі проти половців","описати хід бойових дій та наголосити на великих утратах","припинити боротьбу проти половців через порожню скарбницю","повідомити про обставини полону князя Ігоря","запропонувати мир половцям"));
        dbHelpers.addData(new DateDb(43,"«Ти у мене одна, ти кров моя: чи захочу я тебе погубити? Убожество моє, старость силують мене швидше заміж тебе оддати... Я тобі не ворог. Правда, Петро – добрий парубок, та де ж він?» – звертається до дочки","Горпина Терпилиха","Настя Дрот","Маруся Кайдашиха","Палажка Боруля","Меланія Черевань"));
        dbHelpers.addData(new DateDb(44,"Зачинателем нової української прози називають","Григорія Квітку-Основ’яненка","Івана Котляревського","Григорія Сковороду","Івана Нечуя-Левицького","Івана Карпенка-Карого"));
        dbHelpers.addData(new DateDb(45,"Провідну думку твору «І мертвим, і живим, і ненарожденним…» виражено в рядку","«Обніміться ж, брати мої, / Молю вас, благаю!»","«Кайданами міняються, / Правдою торгують. / І Господа зневажають…»","«Ох, якби те сталось, щоб ви не вертались...»","«У нас воля виростала, / Дніпром умивалась…»","«Не чваньтесь, з вас деруть ремінь, / А з їх, бувало, й лій топили»."));
        dbHelpers.addData(new DateDb(46,"Образ Івана Брюховецького з роману «Чорна рада» схарактеризовано в рядку","владолюбний політичний авантюрист без честі й совісті","курінний отаман, людина високих моральних якостей","ідеал освіченого гетьмана, здатного об’єднати Україну","священик-полковник, представник патріотичної козацької старшини","веселий і добродушний пан із козаків, ідеал гармонійного хуторянина"));
        dbHelpers.addData(new DateDb(47,"Діалог\n" +
                "\n" +
                "— То сватай Вівдю. Чим же Вівдя негарна? Говорить тонісінько, мов сопілка грає, а тиха, як ягниця.\n" +
                "\n" +
                "— Тиха, як телиця. Я люблю, щоб дівчина була трохи бриклива, щоб мала серце з перцем…\n" +
                "\n" +
                "відбувається між","Карпом і Лавріном Кайдашами","Михайлом і Савою Федорчуками","Миною і Мокієм Мазайлами","Лавріном і Романом Запорожцями","Мартином та Степаном Борулями"));
        dbHelpers.addData(new DateDb(48,"«Були вони всі три панські й повиростали по панських дворах. Лушня був пана Совинського, а Пацюк та Матня – пана Польського, того самого, що й Чіпчин батько», – сказано про персонажів","соціально-психологічного роману","історичного роману","соціально-побутової повісті","сентиментально-реалістичної повісті","пригодницького роману"));
        dbHelpers.addData(new DateDb(49,"Зав’язкою твору «Мартин Боруля» є","Мартин Боруля вирішує подати апеляцію до суду","Омелько розповідає про свою пригоду в місті","Степана виряджають у місто на службу","Гервасій пропонує Мартину одружити їхніх дітей","Націєвський приїжджає до Мартина Борулі"));
        dbHelpers.addData(new DateDb(50,"Проблему формування нації на основі біблійного сюжету висвітлено у творі","«Мойсей»","«Кайдашева сім’я»","«Кавказ»","«Тіні забутих предків»","«Всякому місту – звичай і права…»"));
        dbHelpers.addData(new DateDb(51,"«Не був жадний багатства – не на те гуцул жиє на світі,– саме плекання маржинки сповняло радістю серце. Як дитина для мами – такою була для нього худібка…» – сказано про","Івана Палійчука","Саву Федорчука","Степана Радченка","Лавріна Запорожця","Лавріна Кайдаша"));
        dbHelpers.addData(new DateDb(52,"В уривку\n" +
                "\n" +
                "О земле втрачена, явися\n" +
                "бодай у зболеному сні,\n" +
                "і лазурово простелися,\n" +
                "і душу порятуй мені\n" +
                "\n" +
                "провідним художнім засобом є","метафора","гіпербола","рефрен","риторичне питання","порівняння"));
        dbHelpers.addData(new DateDb(53,"За стилем твір «Лісова пісня» є","неоромантичним","імпресіоністичним","постмодерним","реалістичним","сентиментальним"));
        dbHelpers.addData(new DateDb(54,"«Дивна вона… навіть не розуміла, яка вона чарівна… І це дівчина – звіроловка, переможниця страхіть усяких!.. Як та дика коза, що боїться, щоб її не впіймали, і не дається навіть підступити…» – сказано про","Наталку Сірко","Мотрю Довбиш","Олесю Запорожець","Марусю Дрот","Лесю Черевань"));
        dbHelpers.addData(new DateDb(55,"Образ Данилка з новели «Дитинство» суголосний з образом головного героя твору","«Зачарована Десна»","«Кайдашева сім’я»","«Земля»","«Місто»","«Тигролови»"));
        dbHelpers.addData(new DateDb(56,"Складність людських стосунків, виражена через історію нещасливого кохання це тема новели ","«Три зозулі з поклоном»","«Тіні забутих предків»","«Маруся Чурай»","«Лісова пісня»","«Земля»"));
        dbHelpers.addData(new DateDb(57,"«Подумай, що скажуть на тім світі діди й прадіди наші, почувши, що ти міняєш прізвище...» – застерігає брата","Тарас Мазайло","Михайло Федорчук","Марися Боруля","Наталка Сірко","Роман Запорожець"));
        dbHelpers.addData(new DateDb(58,"До інтимної лірики належить вірш","«Ви знаєте, як липа шелестить…»","«Задивляюсь у твої зіниці…»","«Ти знаєш, що ти – людина?»","«Любіть Україну!»","«Блакитна Панна»"));
        dbHelpers.addData(new DateDb(59,"У поезії «Стилет чи стилос?» автор розмірковує про","роль митця в суспільстві","швидкоплинність життя","кохання та зраду","конфлікт поколінь","красу весняної природи"));
        dbHelpers.addData(new DateDb(60,"Ознаки постмодернізму мають рядки","«Німець каже: Ви слов’яне? – Слов’яне! Слов’яне! / Наше слово полум’яне / Повік не зов’яне!..»","«Я знаю, дід та баба – це коли є онуки, а в них сусідські діти шовковицю їдять…»","«Для нас вона в світі єдина, одна / в просторів солодкому чарі... Вона у зірках, і у вербах вона, / і в кожному серця ударі…»","«О слово рідне! Орле скутий! / Чужинцям кинуте на сміх! Співочий грім батьків моїх…»","«Народе мій, до тебе я ще верну, / як в смерті обернуся до життя своїм стражденним і незлим обличчям…»"));


        //TODO 2018 additional
        dbHelpers.addData(new DateDb(61,"Рядки\n" +
                "\n" +
                "Чогось мені, козаченьки,\n" +
                "Мед-вино не п’ється:\n" +
                "Десь-то син мій, Морозенко,\n" +
                "З татарами б’ється!\n" +
                "\n" +
                "узято з","історичної пісні","народної думи","народної балади","родинно-побутової пісні","календарно-обрядової пісні"));
        dbHelpers.addData(new DateDb(62,"Рефреном у вірші «Всякому місту – звичай і права» є рядки","Я ж у полоні нав’язливих дум, Лише одне непокоїть мій ум…","Всякому місту – звичай і права, Всяка тримає свій ум голова…","Всякому серцю – любов і тепло, Всякеє горло свій смак віднайшло…","Той безперервно стягає поля, Сей іноземних заводить телят…","Хто ж бо зневажить страшну її сталь? Той, в кого совість, як чистий кришталь…"));
        dbHelpers.addData(new DateDb(63,"Першим твором нової української літератури є","бурлескно-травестійна поема","сентиментально-реалістична повість","історичний роман","сатирична поема","пригодницький роман"));
        dbHelpers.addData(new DateDb(64,"Зав’язкою твору «Маруся» є","знайомство Марусі з Василем","розповідь про Наума та Настю","перша зустріч Василя з Наумом","подорож Марусі й Олени до міста","сватання Василя до Марусі"));
        dbHelpers.addData(new DateDb(65,"Рядки\n" +
                "\n" +
                "То покритка попідтинню\n" +
                "З байстрям шкандибає,\n" +
                "Батько й мати одцурались,\n" +
                "Й чужі не приймають…\n" +
                "\n" +
                "суголосні з долею героїні твору","«Катерина»","«Маруся»","«Наталка Полтавка»","«Кайдашева сім’я»","«Мартин Боруля»"));
        dbHelpers.addData(new DateDb(66,"Поєднання історичної та любовної сюжетних ліній стало взірцем для написання твору","«Чорна рада»","«Кайдашева сім’я»","«Тіні забутих предків»","«Лісова пісня»","«Земля»"));
        dbHelpers.addData(new DateDb(67,"На прощу до Києва вирушають героїні обох творів у рядку","«Кайдашева сім’я» та «Маруся Чурай»","«Дума про Марусю Богуславку» та «Кайдашева сім’я»","«Маруся» та «Хіба ревуть воли, як ясла повні?»","«Наталка Полтавка» та «Мартин Боруля»","«Маруся Чурай» та «Тигролови»"));
        dbHelpers.addData(new DateDb(68,"Ідея соборності України, пошуки суспільної сили, спроможної згуртувати й об’єднати націю, характерні для обох творів у рядку","«Чорна рада» та «І мертвим, і живим, і ненарожденним…»","«Тіні забутих предків» та «Чорна рада»","«Хіба ревуть воли, як ясла повні?» та «Чорна рада»","«Я (Романтика)» та «І мертвим, і живим, і ненарожденним…»","«Тигролови» та «Хіба ревуть воли, як ясла повні?»"));
        dbHelpers.addData(new DateDb(69,"«Апеляція! Та таку апеляцію напишіть, щоб у Красовського в носі закрутило, щоб йому свербіло!.. Я грошей не пожалію, аби мені Красовського в острог посадить...» – вигукує персонаж твору, у якому батько","забороняє доньці виконувати хатню роботу","сварить синів за нікчемні балачки у святу п’ятницю","гостює з сином на хуторі заможного козака","намагається відкупити сина від рекрутчини","рятує односельців від повені у Великодню суботу"));
        dbHelpers.addData(new DateDb(70,"Вічний дух, що прагне до щастя й волі, революційних перетворень, згаданий у рядку","«Словом сильним, мов трубою, / Мiлiони зве з собою...»","«Хоч в сні на вид твій оживає, / Хоч в жалощах живіше грає…»","«Співочий грім батьків моїх, / Дітьми безпам’ятно забутий…»","«Сяє вродою святою, / Неземною чистотою…»","«У зойках гудків, і у хвилях Дніпра, / У хмарах отих пурпурових...»"));
        dbHelpers.addData(new DateDb(71,"У рядках поезії Андрія Малишка\n" +
                "\n" +
                "І в дорогу далеку ти мене на зорі проводжала,\n" +
                "І рушник вишиваний на щастя, на долю дала...\n" +
                "\n" +
                "ужито","епітет","паралелізм","персоніфікацію","гіперболу","порівняння"));
        dbHelpers.addData(new DateDb(72,"«Суперечність між одвічним ідеалом любові й тим беззастережним служінням абстрактній ідеї, доктрині, яке, мов ненаситний молох, зрештою вимагає зректися всього людського», розкрито у творі","«Я (Романтика)»","«Мина Мазайло»","«Маруся Чурай»","«Дитинство»","«Земля»"));
        dbHelpers.addData(new DateDb(73,"«Йду поміж люди. Душа готова, струни тугі, наладжені, вона вже грає...» – розмірковує оповідач твору","Михайла Коцюбинського","Валер’яна Підмогильного","Ольги Кобилянської","Юрія Яновського","Григора Тютюнника"));
        dbHelpers.addData(new DateDb(74,"У висловлюванні Василя Стуса «Його доля воістину трагічна. В історії світової літератури, мабуть, не знайдеться іншого такого прикладу, коли б поет віддав половину свого життя високій поезії, а половину – нещадній боротьбі зі своїм обдаруванням» ідеться про","Павла Тичину","Олександра Олеся","Миколу Зерова","Євгена Маланюка","Василя Симоненка"));
        dbHelpers.addData(new DateDb(75,"Радист Віталик та його кохана Тоня це персонажі твору ","«Залізний острів»","«Мина Мазайло»","«Місто»","«Три зозулі з поклоном»","«Тіні забутих предків»"));
        dbHelpers.addData(new DateDb(76,"Рядки\n" +
                "\n" +
                "З поетичних бомбосховищ\n" +
                "Виліз рій нових страховищ:\n" +
                "Небурак і Антрухович,\n" +
                "Риммарук, Б’уряк, Мал-кович…\n" +
                "\n" +
                "є прикладом","постмодернізму","неоромантизму","імпресіонізму","реалізму","сентименталізму"));
        dbHelpers.addData(new DateDb(77,"В уривку «Хлопець сильної будови, здоровий – мав ще одного молодшого здоровенного брата. Родичі також не були ще надто перестарілі, могли обходитися без нього в хазяйстві, і тяжко було думати про увільнення його з війська…» сказано про","Михайла Федорчука","Григорія Многогрішного","Карпа Кайдаша","Івана Палійчука","Степана Радченка"));
        dbHelpers.addData(new DateDb(78,"Поет-емігрант є автором вірша","«Стилет чи стилос?»","«Ви знаєте, як липа шелестить…»","«Любіть Україну!»","«Задивляюсь у твої зіниці…»","«Блакитна Панна»"));
        dbHelpers.addData(new DateDb(79,"Словами «А ще думаю: “Чому вони не одружилися, так одне одного чуючи?” “Тоді не було б тебе…” – шумить велика “татова” сосна» закінчується твір","«Три зозулі з поклоном»","«Маруся Чурай»","«Лісова пісня»","«Зачарована Десна»","«Тіні забутих предків»"));
        dbHelpers.addData(new DateDb(80,"Важку долю українських жінок в умовах Другої світової війни зображено у творі","«Україна в огні»","«Місто»","«Залізний острів»","«Тигролови»","«Три зозулі з поклоном»"));

        //TODO 2017 main
        dbHelpers.addData(new DateDb(81,"Рядки\n" +
                "\n" +
                "В кінці греблі шумлять верби,\n" +
                "Що я насадила…\n" +
                "Нема того козаченька,\n" +
                "Що я полюбила…\n" +
                "\n" +
                "є в","родинно-побутовій пісні","календарно-обрядовій пісні","суспільно-побутовій пісні","історичній пісні","народній думі"));
        dbHelpers.addData(new DateDb(82,"В уривку «Та коли він повертався назад, він роздумував [і] сказав дружині своїй: “Ідіте ви з даниною додому, а я вернусь і походжу іще”. І відпустив він дружину свою додому, а з невеликою дружиною вернувся, жадаючи більше майна…» сказано про","Ігоря (уривок про помсту княгині Ольги, «Повість минулих літ»)","Кия (уривок про заснування Києва, «Повість минулих літ»)","Ігоря («Слово про похід Ігорів »)","Мала (уривок про помсту княгині Ольги, «Повість минулих літ»)","Всеволода («Слово про похід Ігорів»)"));
        dbHelpers.addData(new DateDb(83,"Рядки\n" +
                "\n" +
                "Вергілій, бач, не нам був рівня,\n" +
                "А видно, що начухав тім’я,\n" +
                "Поки дрібненько описав\n" +
                "\n" +
                "є в","бурлескно-травестійній поемі","сатиричній комедії","ліричній драмі","драмі-феєрії","романі у віршах"));
        dbHelpers.addData(new DateDb(84,"Уривок «Таточку, голубчику, соколику, лебедику! Матінко моя ріднесенька… голубочко! Не погубляйте свого дитяти; дайте мені, бідненькій, ще на світі пожити! Не розлучайте мене з моїм Василечком…» узято з твору","«Маруся»","«Кайдашева сім’я»","«Наталка Полтавка»","«Мартин Боруля»","«Чорна рада»"));
        dbHelpers.addData(new DateDb(85,"Розділи «Свято в Чигирині», «Червоний бенкет», «Лебедин» є у творі, де діють герої","Ярема Галайда, Іван Гонта","Сгошуа, Авірон","Яким Сомко, Леся Черевань","Дідона, Сивілла","Мотря Жуківна, Чіпка Вареник"));
        dbHelpers.addData(new DateDb(86,"Підзаголовок «Хроніка 1663 року» має твір","Пантелеймона Куліша","Тараса Шевченка","Панаса Мирного","Ольги Кобилянської","Михайла Коцюбинського"));
        dbHelpers.addData(new DateDb(87,"«Часто трапляються сім’ї, в котрих буває така колотнеча та завсідня лайка та сварка, що життя в хаті стає якимсь пеклом», – сказано про твір, у якому є такий епізод","громада у волості обирає односельця за десяцького","чоловік бере уроки «правильних проізношеній»","батько віддає сина в москалі","діти з\"їжджаються на 55-річчя матері","героїня не визнає своїх онуків-близнят"));
        dbHelpers.addData(new DateDb(88,"Образ селянина, який у пошуках правди став злочинцем, змальовано у творі","«Хіба ревуть воли, як ясла повні?»","«Чорна рада»","«Тигролови»","«Я (Романтика)»","«Тіні забутих предків»"));
        dbHelpers.addData(new DateDb(89,"Художній напрям «Мартин Боруля»:","реалізм","романтизм","бароко","класицизм","імпресіонізм"));
        dbHelpers.addData(new DateDb(90,"Казку про те, як дерева обирали собі короля, розповідає","Мойсей","Боян","Чугайстир","Еней","Лісовик"));
        dbHelpers.addData(new DateDb(91,"Ну, як-таки щоб воля – та пропала?\n" +
                "Се так колись і вітер пропаде! —\n" +
                "\n" +
                "дивується персонаж «Лісової пісні»","Мавка","Лісовик","дядько Лев","Перелесник","Лукаш"));
        dbHelpers.addData(new DateDb(92,"Урочище Аскольдова могила згадано у творі","Павла Тичини","Івана Котляревського","Григорія Сковороди","Олександра Довженка","Миколи Хвильового"));
        dbHelpers.addData(new DateDb(93,"Слова «А той Грицько Нечоса характерник був, як і всі запорожці, пройшов крізь військо і турбаїв вивів, і повів на дві сторони: до Дністра й до Перекопу, і ми з роду турбаїв, не були кріпаками зроду-віку, і Данилко хай не буде» належать героєві твору","«Дитинство»","«Наталка Полтавка»","«Чорна рада»","«Кайдашева сім’я»","«Мартин Боруля»"));
        dbHelpers.addData(new DateDb(94,"Образ юного Тичини, який «животворив душею давній міт / І “Плуга” вів у сонячні комуни», є у творі","«Київ – традиція»","«Страшні слова, коли вони мовчать»","«Як добре те, що смерті не боюсь я»","«О слово рідне! Орле скутий!..»","«Стилет чи стилос?»"));
        dbHelpers.addData(new DateDb(95,"Темою твору «Україна в огні» є","трагічні події Другої світової війни","життя української родини в добу Руїни","боротьба повстанців проти царських військ","спогади автора про Першу світову війну","визволення Києва від фашистських загарбників"));
        dbHelpers.addData(new DateDb(96,"В уривку «За царського режиму, як свідчать дореволюційні рибалки-письменники, сом важив до чотирьохсот кілограмів, ковтав собак і ведмедів. Можливо, що з розвитком рибальства сом важитиме тонну і ковтатиме симентальських бугаїв і невеличкі буксирні пароплави» основним художнім засобом є","гіпербола","алегорія","паралелізм","порівняння","персоніфікація"));
        dbHelpers.addData(new DateDb(97,"«Філософський роздум-декларація, у якому антигуманний світ виявився безсилим перед духом та етикою в’язня совісті», – сказано про твір","«Як добре те, що смерті не боюсь я»","«Ти знаєш, що ти — людина?»","«Страшні слова, коли вони мовчать»","«Стилет чи стилос?»","«Любіть Україну!»"));
        dbHelpers.addData(new DateDb(98,"Ну, є ж про зраду там які статті?\n" +
                "Не всяка ж кара має буть незбожна.\n" +
                "Що ж це виходить?\n" +
                "Зрадити в житті державу — злочин, а людину — можна?! – запитує герой твору","«Маруся Чурай»","«Лісова пісня»","«Катерина»","«Мойсей»","«Гайдамаки»"));
        dbHelpers.addData(new DateDb(99,"Лозов’ягін – справжнє прізвище автора","пригодницького роману","роману в новелах","неокласичного сонета","кіноповісті","усмішки"));
        dbHelpers.addData(new DateDb(100,"Рядки Юрія Іздрика\n" +
                "\n" +
                "ніч така місячна зоряна ясная\n" +
                "видно хоч голки збирай\n" +
                "зоряні війни здаються невчасними\n" +
                "вчасним здається рай\n" +
                "\n" +
                "ілюструють пародійну гру з чужими текстами, характерну для","постмодернізму","романтизму","неоромантизму","імпресіонізму","неокласицизму"));


        //TODO 2017 additional
        dbHelpers.addData(new DateDb(101,"До фольклорних належать обидва твори в рядку","«Віють вітри» та «Ой летіла стріла»","«Ой Морозе, Морозенку» та «Бджола та Шершень»","«Дума про Марусю Богуславку» та «Маруся Чурай»","«Чи не той то хміль…» та «Повість минулих літ»","«Засвіт встали козаченьки» та «Слово про похід Ігорів»"));
        dbHelpers.addData(new DateDb(102,"Порівнює свободу із золотом ліричний герой вірша","«De libertate»","«Всякому місту – звичай і права»","«Contra spem spero!»","«Стилет чи стилос?»","«О слово рідне! Орле скутий!..»"));
        dbHelpers.addData(new DateDb(103,"Чудесну зброю для Енея, яку «і куля не бере», викував","Вулкан","Меркурій","Еол","Плутон","Бахус"));
        dbHelpers.addData(new DateDb(104,"Максим Залізняк та Іван Гонта є персонажами твору","Тараса Шевченка","Івана Котляревського","Панаса Мирного","Івана Франка","Григорія Квітки-Основ’яненка"));
        dbHelpers.addData(new DateDb(105,"«Його вчинки відчайдушні й непередбачувані, неймовірні, суперечливі: то він, шибайголова й паливода, викрадає наречену Сомка, то йде на смерть заради визволення гетьмана з темниці…» – сказано про","Кирила Тура","Івана Брюховецького","Петра Шраменка","Матвія Гвинтовку","Михайла Череваня"));
        dbHelpers.addData(new DateDb(106,"Звістка про загибель Якова де Бальмена, друга автора, стала поштовхом до написання твору","«Кавказ»","«Чорна рада»","«Гайдамаки»","«Мойсей»","«І мертвим, і живим, і ненарожденним…»"));
        dbHelpers.addData(new DateDb(107,"За родовою ознакою драматичним є твір","«Мартин Боруля»","«Земля»","«Хіба ревуть воли, як ясла повні?»","«Тіні забутих предків»","«Маруся»"));
        dbHelpers.addData(new DateDb(108,"Видає себе за Хруща, Хрущова, Притику герой твору «Хіба ревуть воли, як ясла повні?»","Іван Вареник","Василь Порох","Чіпка Варениченко","Максим Ґудзь","Грицько Чупруненко"));
        dbHelpers.addData(new DateDb(109,"Сповідь ліричного героя коханій, яка згордувала його почуттями, – це провідний мотив твору","«Чого являєшся мені у сні?..»","«Задивляюсь у твої зіниці…»","«Contra spem spero!»","«Блакитна Панна»","«Чари ночі»"));
        dbHelpers.addData(new DateDb(110,"Занепад споконвічної важливої ролі батька в українському суспільстві, руйнування традиційних підвалин життя селянства в пореформену добу зображено у творі","«Кайдашева сім’я»","«Маруся»","«Мартин Боруля»","«Чорна рада»","«Наталка Полтавка»"));
        dbHelpers.addData(new DateDb(111,"Біблійний мотив каїнового гріха відчутний у творі","«Земля»","«Енеїда»","«Мойсей»","«Я (Романтика)»","«Маруся»"));
        dbHelpers.addData(new DateDb(112,"Cонетом є твір","«Київ – традиція»","«De libertate»","«Contra spem spero!»","«Стилет чи стилос?»","«Страшні слова, коли вони мовчать»"));
        dbHelpers.addData(new DateDb(113,"У «Лісовій пісні» слова Лукаша про солов’їв, що «вже не щебечуть, не тьохкають, як завжди, а співають: “Цілуй! Цілуй! Цілуй!”», перегукуються з рядками вірша","«Чари ночі»","«Чого являєшся мені у сні?..»","«Ви знаєте, як липа шелестить…»","«Молюсь і вірю. Вітер грає…»","«О панно Інно…»"));
        dbHelpers.addData(new DateDb(114,"Протистояння добра і зла в душі героя («чекіста і людини»), його роздвоєність це тема твору ","Я (Романтика)","Місто","Зачарована Десна","Тигролови","Заповіт"));
        dbHelpers.addData(new DateDb(115,"«Але картиною над картинами була картина страшного Божого суду, що її мати купила за курку на ярмарку на страх лютим своїм ворогам – бабі, дідові і батькові. Вона була така страшенна й разом з тим повчальна, що на неї боявсь дивитися навіть Пірат…» – згадує оповідач твору","«Зачарована Десна»","«Тіні забутих предків»","«Кайдашева сім’я»","«Дитинство»","«Земля»"));
        dbHelpers.addData(new DateDb(116,"У рядку\n" +
                "\n" +
                "Любові усміх квітне раз – ще й тлінно\n" +
                "\n" +
                "основним художнім засобом є","метафора","порівняння","тавтологія","паралелізм","гіпербола"));
        dbHelpers.addData(new DateDb(117,"«Соню, сходи до неї і скажи, що я послав їй, як співав на ярмарках Зінківських бандуристочка сліпий, послав три зозулі з поклоном, та не знаю, чи перелетять вони Сибір несходиму, а чи впадуть од морозу…» – пише додому герой твору","Григора Тютюнника","Олеся Гончара","Валер’яна Підмогильного","Олександра Довженка","Юрія Яновського"));
        dbHelpers.addData(new DateDb(118,"Різдвяну містерію, де давні волхви перетворюються на сусідських дядьків-лемків, які принесли до хати традиційну святкову хлібину, змалював","Богдан-Ігор Антонич","Олександр Олесь","Микола Вороний","Павло Тичина","Максим Рильський"));
        dbHelpers.addData(new DateDb(119,"Там дивний ліс зітхає ароматом\n" +
                "\n" +
                "І весь дзвенить од гімнів п’яних птиць,\n" +
                "\n" +
                "Співа трава, ніким ще не зім’ята,\n" +
                "\n" +
                "І вабить сном солодких таємниць –\n" +
                "\n" +
                "таким уявляє ідеальний світ мистецтва ліричний герой вірша","«Стилет чи стилос?»","«Молюсь і вірю. Вітер грає…»","«О земле втрачена, явися!..»","«Задивляюсь у твої зіниці…»","«Страшні слова, коли вони мовчать»"));
        dbHelpers.addData(new DateDb(120,"Рядки Івана Андрусяка\n" +
                "\n" +
                "лузає сім’я плодить бацили\n" +
                "\n" +
                "ходить по колу лається ямбом\n" +
                "\n" +
                "я не приніс тобі славу і силу\n" +
                "\n" +
                "тільки маленьку жовту троянду\n" +
                "\n" +
                "передають хаос світовідчуття, емоційний стан сучасної людини, які характерні для літератури","постмодернізму","сентименталізму","імпресіонізму","неоромантизму","неокласицизму"));

        //TODO 2016 main
        dbHelpers.addData(new DateDb(121,"Над Чорним морем у Великодню суботу відбуваються події твору","«Дума про Марусю Богуславку»","«Засвіт встали козаченьки»","«Ой Морозе, Морозенку»","«Чи не той то Хміль...»","«Бондарівна»"));
        dbHelpers.addData(new DateDb(122,"Прилинути чайкою на край світу, щоб витерти милому «кривавії його рани на дужому його тілі», прагне","Ярославна","княгиня Ольга","Бондарівна","Либідь","Маруся Богуславка"));
        dbHelpers.addData(new DateDb(123,"«Самобутній і глибоко національний твір, де стародавніх троянців і латинян переодягнено в жупани й кобеняки українського козацтва ХVIII століття», - написав","Іван Котляревський","Григорій Сковорода","Тарас Шевченко","Пантелеймон Куліш","Іван Франко"));
        dbHelpers.addData(new DateDb(124,"У повісті «Маруся» кохання з першого погляду Василя й Марусі є","зав'язкою","експозицією","розвитком дії","кульмінацією","розв’язкою"));
        dbHelpers.addData(new DateDb(125,"Якову де Бальмену присвячено твір","«Кавказ»","«Катерина»","«Сон» («У всякого своя доля...»)","«Гайдамаки»","«І мертвим, і живим, і ненарожденним...»"));
        dbHelpers.addData(new DateDb(126,"«Про славу думає лицар, а не про те, щоб ціла була голова на плечах. Не сьогодні, так завтра поляже вона, як од вітру на степу трава; а слава ніколи не вмре, не поляже, лицарство козацьке всякому розкаже», - вважає","Кирило Тур","Ярема Галайда","Карпо Кайдаш","Чіпка Варениченко","Михайло Федорчук"));
        dbHelpers.addData(new DateDb(127,"Пряме звертання до видатного українського полководця й державного діяча Богдана Хмельницкого є у творі","«De libertate»","«Contra spem spero!»","«Intermezzo»","«Засвіт встали козаченьки»","«Україна в огні»"));
        dbHelpers.addData(new DateDb(128,"Життєпис злочинця, зображений на широкому суспільному тлі, - такою є тема твору","«Хіба ревуть воли, як ясла повні?»","«Максим Гримач»","«Тіні забутих предків»","«Мартин Боруля»","«Кайдашева сім'я»"));
        dbHelpers.addData(new DateDb(129,"«Нащо ж дворянство нам здалося, коли воно горе приносе? Коли через нього ви хочете мене нещасною зробить, занапастить мій вік молодий!...» - заявляє","Марися Боруля","Галя Ґудзь","Леся Череванівна","Катря Гримач","Маруся Дрот"));
        dbHelpers.addData(new DateDb(130,"Як я люблю тебе без тями,\n" +
                "Як мучусь довгими ночами\n" +
                "І як літа вже за літами\n" +
                "Свій біль, свій жаль, свої пісні\n" +
                "У серці здавлюю на дні, -\n" +
                "\n" +
                "зізнається коханій ліричний герой твору","Івана Франка","Олександра Олеся","Павла Тичини","Миколи Вороного","Володимира Сосюри"));
        dbHelpers.addData(new DateDb(131,"Косач - це справжнє прізвище автора твору","«Contra spem spero!»","«Чари ночі»","«Блакитна Панна»","«Момент»","«Intermezzo»"));
        dbHelpers.addData(new DateDb(132,"«Цвітові яблуні» (новела М. Коцюбинського) присвячено твір","«Цвітові яблуні» (новела М. Коцюбинського) присвячено твір","Лесі Українки","Володимира Винниченка","Ольги Кобилянської","Павла Тичини"));
        dbHelpers.addData(new DateDb(133,"Трагічні події серпня 1919 року зображені у творі","«Подвійне коло»","«За мить щастя»","«Земля»","«Україна в огні»","«Тигролови»"));
        dbHelpers.addData(new DateDb(134,"«Коли ти мене любиш, зроби так, щоб Мокій закохався у тебе. Може, він кине свої українські фантазії, може, хоч прізвище дасть поміняти...», - просить подругу","Рина Мазайло","Наталка Сірко","Марфа Яркова","Олеся Запорожець","Марися Боруля"));
        dbHelpers.addData(new DateDb(135,"«Багато його усмішок - це розгорнуті сцени, де дійові особи живуть і діють немовби на підмостках», - сказано про твори","Остапа Вишні","Олеся Гончара","Івана Драча","Валер’яна Підмогильного","Олександра Довженка"));
        dbHelpers.addData(new DateDb(136,"В уривку «У місто вливається свіжа кров села, що змінить його вигляд й істоту, і він один із цієї зміни, що їй від долі призначено перемогти» йдеться про","Степана Радченка","Мокія Мазайла","Григорія Многогрішного","Івана Дідуха","Романа Запорожця"));
        dbHelpers.addData(new DateDb(137,"«Сонця хлюпочуться в озерах, / спадають гуси до води, / в далеких пожиттєвих ерах / мої розтанули сліди», - такою уявляє Вітчизну ліричний герой твору","«О земле втрачена, явися!..»","«Українське альфреско»","«Любіть Україну»","«Стилет чи стилос?»","«Молюсь і вірю»"));
        dbHelpers.addData(new DateDb(138,"«Він народився під такою зіркою, / що щось в душі двоїлося йому. / Від того кидавсь берега до того. / Любив достаток і любив пісні», - сказано про","Грицька Бобренка","Леська Черкеса","Івана Іскру","Мартина Пушкаря","Семена Горбаня"));
        dbHelpers.addData(new DateDb(139,"Життя українців Зеленого Клину змалював у своєму творі","Іван Багряний","Григір Тютюнник","Юрій Яновський","Володимир Винниченко","Микола Куліш"));
        dbHelpers.addData(new DateDb(140,"Гра зі словом, образом, «чужим текстом», поєднання різнорідних і несумісних елементів, наскрізна іронічність - характерні риси","постмодернізму","експресіонізму","бароко","романтизму","імпресіонізму"));


        //TODO 2016 additional
        dbHelpers.addData(new DateDb(141,"Рядки\n" +
                "\n" +
                "Ой з-за гори та з-за кручі\n" +
                "Буйне військо виступає,\n" +
                "Попереду Морозенко\n" +
                "Сивим конем виграває\n" +
                "\n" +
                "взяті з","історичної пісні","думи","балади","суспільно-побутової пісні","календарно-обрядової пісні"));
        dbHelpers.addData(new DateDb(142,"У «Слові про похід Ігорів» буй-туром (яр-туром) названо","Всеволода","Святослава","Ігоря","Володимира","Ярослава"));
        dbHelpers.addData(new DateDb(143,"«Ваша “Маруся” так мені про Вас розказала, що я Вас навиліт знаю», – написав Тарас Шевченко","Григорієві Квітці-Основ’яненку","Іванові Котляревському","Пантелеймонові Кулішу","Іванові Нечую-Левицькому","Панасові Мирному"));
        dbHelpers.addData(new DateDb(144,"У творі «Наталка Полтавка» освідчення возного Наталці «Я тебе люблю і женитись на тобі хочу» є","зав’язкою","експозицією","розвитком дії","кульмінацією","розв’язкою"));
        dbHelpers.addData(new DateDb(145,"Образ гетьмана Полуботка наявний у творі","«Сон» («У всякого своя доля…»)","«Гайдамаки»","«До Основ’яненка»","«Кавказ»","«І мертвим, і живим, і ненарожденним…»"));
        dbHelpers.addData(new DateDb(146,"«Запорожжя споконвіку було серцем українським, на Запорожжі воля ніколи не вмирала, давні звичаї ніколи не забувались», – пише автор твору","«Чорна рада»","«Максим Гримач»","«Камінний хрест»","«Хіба ревуть воли, як ясла повні?»","«Тіні забутих предків»"));
        dbHelpers.addData(new DateDb(147,"Іван Франко автор рядків","«Дух, що тіло рве до бою Рве за поступ, щастя й волю, Він живе, він ще не вмер…»","«Обніміться ж, брати мої. Молю вас, благаю!..»","«О, якби в дурні мені не пошитись, Щоб без свободи не міг я лишитись…»","«Стилет чи стилос? – не збагнув. Двояко Вагаються трагічні терези…»","«Так! Я буду крізь сльози сміятись, Серед лиха співати пісні…»"));
        dbHelpers.addData(new DateDb(148,"Вілінська – справжнє прізвище автора твору","«Максим Гримач»","«Чого являєшся мені у сні…»","«Блакитна Панна»","«Contra spem spero!»","«Intermezzo»"));
        dbHelpers.addData(new DateDb(149,"«Я не хочу буть дворянкою! Краще жить на світі щасливим мужиком, ніж нещасним паном, – це всяке знає!..» – заявляє матері","Марися Боруля","Галя Ґудзь","Маруся Дрот","Леся Черевань","Мелашка Балаш"));
        dbHelpers.addData(new DateDb(150,"Як іскра ще в тобі горить\n" +
                "І згаснути не вспіла, –\n" +
                "Гори! Життя – єдина мить,\n" +
                "Для смерті ж – вічність ціла, –\n" +
                "закликає ліричний герой твору","Олександра Олеся","Івана Франка","Павла Тичини","Миколи Вороного","Василя Симоненка"));
        dbHelpers.addData(new DateDb(151,"«Народе мій, до тебе я ще верну, / і в смерті обернуся у життя», – заявляє ліричний герой поезії","«Як добре те, що смерті не боюсь я»","«Молюсь і вірю…»","«Різдво»","«Українське альфреско»","«Стилет чи стилос?»"));
        dbHelpers.addData(new DateDb(152,"«І уже в душі моїй / В сяйві мрій / В’ються хмелем арабески, / Миготять камеї, фрески, / Гомонять-бринять пісні / Голосні / І сплітаються в гротески», – заявляє ліричний герой поезії","Миколи Вороного","Василя Симоненка","Івана Драча","Василя Стуса","Павла Тичини"));
        dbHelpers.addData(new DateDb(153,"«Глибокий потрясаючий конфлікт революціонера-людини й революціонера-фанатика, людини й догми» зображено у творі","«Я (Романтика)»","«Шаланда в морі»","«Моя автобіографія»","«Місто»","«Момент»"));
        dbHelpers.addData(new DateDb(154,"«А твоя теорія, що українська мова є австріяцька видумка, була теорією російських жандармів і царського міністра Валуєва», – говорить батькові","Мокій Мазайло","Степан Радченко","Роман Запорожець","Гриць Сірко","Оверко Половець"));
        dbHelpers.addData(new DateDb(155,"На тлі Другої світової війни розгортаються події твору","«Україна в огні»","«Я (Романтика)»","«Момент»","«Подвійне коло»","«Тигролови»"));
        dbHelpers.addData(new DateDb(156,"Мудрою батьковою настановою «Тому роду нема переводу, в котрому браття милують згоду» нехтують сини у творі","«Подвійне коло»","«Кайдашева сім’я»","«Чорна рада»","«Камінний хрест»","«Україна в огні»"));
        dbHelpers.addData(new DateDb(157,"У рядках\n" +
                "\n" +
                "…Гетьман підняв безсонням обпалені очі.\n" +
                "Гетьман сидів за похідним столом у шатрі.\n" +
                "Троє старшин – у рубцях, у кривавому клоччі –\n" +
                "прямо із бою – говорили про бій на Дніпрі.\n" +
                "Писар Виговський сидів над листами поточними.\n" +
                "Кожної миті хитнутись могли терези\n" +
                "\n" +
                "йдеться про гетьмана","Богдана Хмельницького","Івана Брюховецького","Якима Сомка","Дем’яна Многогрішного","Якова Остряницю"));
        dbHelpers.addData(new DateDb(158,"«Лемки у крисанях», які «принесли місяць круглий», є героями твору","Богдана-Ігоря Антонича","Миколи Вороного","Максима Рильського","Олександра Олеся","Павла Тичини"));
        dbHelpers.addData(new DateDb(159,"«Сміливі завжди мають щастя» – такою є ідея твору","«Тигролови»","«Я (Романтика)»","«Подвійне коло»","«Маруся Чурай»","«Три зозулі з поклоном»"));
        dbHelpers.addData(new DateDb(160,"Поезію українського постмодернізму представляє","Ігор Римарук","Василь Симоненко","Ліна Костенко","Євген Маланюк","Василь Стус"));


        // TODO BD TESTS
        // TODO Усна народна творчість
        dbHelpers.addData(new DateDb(161,"Де ти, милий, чорнобривий? Де ти? Озовися!\n" +
                "\n" +
                "Як без тебе я горюю, прийди подивися!\nЙдеться у творі","«Віють вітри» (пісня Марусі Чурай)","«За світ встали козаченьки»","«Ой Морозе, Морозенку»","«Чи не той то хміль…»"));
        dbHelpers.addData(new DateDb(162,"Основна думка: 'Для кожної родини є хвилюючим моментом, коли її сини, чоловіки вирушають у військовий похід' характерна для твору","«Засвіт встали козаченьки» (пісня Марусі Чурай)","«Чи не той то хміль…»","«Ой летіла стріла»","«Віють вітри»"));
        dbHelpers.addData(new DateDb(163,"Возвеличення мудрості, мужності козацького ватажка; засудження жорстокості, підступності татарських поневолювачів - це ідея твору","«Ой Морозе, Морозенку»","«Віють вітри»","«Дума про Марусю Богуславку»","«Ой летіла стріла»"));
        dbHelpers.addData(new DateDb(164,"Жанр «Ой Морозе, Морозенку» - ","Історична пісня","Балада","Дума","Календарно-обрядова пісня"));
        dbHelpers.addData(new DateDb(165,"Уславлення Б. Хмельницького — народного ватажка, талановитого полководця, мудрого державного діяча це ідея твору","«Чи не той то хміль…»","«Ой Морозе, Морозенку»","«Засвіт встали козаченьки»","«Дума про Марусю Богуславку»"));
        dbHelpers.addData(new DateDb(166,"Жанр «Чи не той то хміль…» - ","Історична пісня","Балада","Дума","Календарно-обрядова пісня"));
        dbHelpers.addData(new DateDb(167,"Про якого гетьмана йдеться у творі «Чи не той то хміль…»","Богдан Хмельницький","Кирило Розумовський","Іван Мазепа","Данило Апостол"));
        dbHelpers.addData(new DateDb(168,"Засудження поневолення, страждань, яких зазнали українці під час нападу турків, віра у щасливе вільне життя це ідея твору","«Дума про Марусю Богуславку»","«Віють вітри»","«Засвіт встали козаченьки»","«Ой Морозе, Морозенку»"));
        dbHelpers.addData(new DateDb(169,"Твір про узагальнений образ жінки-полонянки, яка, потрапивши в турецьку неволю і ставши дружиною турецького султана, не забуває рідної землі і намагається хоч щось корисне зробити для неї","«Дума про Марусю Богуславку»","«Віють вітри»","«Ой Морозе, Морозенку»","«Ой летіла стріла»"));
        dbHelpers.addData(new DateDb(170,"Риторичне запитання «Чи ви знаєте, що в нашій землі та й день затепера?» взято з твору","«Дума про Марусю Богуславку»","«Ой летіла стріла»","«Чи не той то хміль…»","«Засвіт встали козаченьки»"));
        dbHelpers.addData(new DateDb(171,"Ідея балади «Ой летіла стріла»","Висловлення співчуття до загиблого","Уславлення щирих почуттів","Оспівування боротьби козаків під керівництвом Морозенка з татарами","Уславлення Б. Хмельницького"));
        dbHelpers.addData(new DateDb(172,"Приліт трьох рябеньких зозуль - .... балади «Ой летіла стріла»","Зав’язка","Розв'язка","Кульмінація","Епілог"));
        dbHelpers.addData(new DateDb(173,"Не вернувся Морозенко,\n" +
                "Голова завзята.\n" +
                "Замучили молодого\n" +
                "Татари прокляті\nуривок з твору","«Ой Морозе, Морозенку»","«Чи не той то хміль…»","«Слово про похід Ігорів»","«Бджола та Шершень»"));
        dbHelpers.addData(new DateDb(174,"І поки над білим світом\n" +
                "Світить сонце буде, —\n" +
                "Твої думи, твої пісні\n" +
                "Не забудуть люди\nуривок з твору","«Ой Морозе, Морозенку»","«Бджола та Шершень»","«Кавказ»","«Дума про Марусю Богуславку»"));
        dbHelpers.addData(new DateDb(175,"До кого я пригорнуся,\n" +
                "І хто пригoлубить,\n" +
                "Коли тепер того нема,\n" +
                "Який мене любить?\nуривок з твору","«Віють вітри, віють буйні»","«Енеїда»","«Мартин Боруля»","«Чого являєшся мені у сні?»"));
        dbHelpers.addData(new DateDb(176,"Не плач, не плач, Марусенько,\nНе плач, не журися\nТа за свого миленького Богу помолися\nуривок з твору","«Засвіт встали козаченьки»","«Балада про соняшник»","«Маруся Чурай»","«Дума про Марусю Богуславку»"));
        dbHelpers.addData(new DateDb(177,"Утікали вражі ляхи,\n" +
                "Деякії повки, —\n" +
                "Їли ляхів собаки\n" +
                "І сірії вовки\nуривок з твору","«Чи не той то Хміль»","«О слово рідне! Орле скутий!..»","«Ви знаєте, як липа шелестить…»","«Ой летіла стріла»"));
        dbHelpers.addData(new DateDb(178,"Вислухай, боже, у просьбах щирих,\n" +
                "У нещасних молитвах\n" +
                "Нас, бідних невольників!\nуривок з твору","Дума про Марусю Богуславку","«Засвіт встали козаченьки»","«Хіба ревуть воли, як ясла повні?»","«Блакитна Панна»"));
        dbHelpers.addData(new DateDb(179,"Яка з наведених ознак НЕ є ознакою народної балади?","значна кількість героїв","напруженість композиції","трагічна розв язка","у центрі сюжету - лише одна подія з життя головного героя"));
        dbHelpers.addData(new DateDb(180,"Що трапилося з Морозенком після бою?","замучили татари","пропав безвісті","порубали на чверті","потрапив у неволю"));
        dbHelpers.addData(new DateDb(181,"Куди придеться ляшенькам утікати? («Чи не той то хміль…»)","Польщу","Литву","Росію","Молдову"));
        dbHelpers.addData(new DateDb(182,"Де відбувалася боротьба козаків з ворогом («Чи не той то хміль…»)","під Жовтими Водами","під Києвом","під Львовом","під Жаботином"));
        dbHelpers.addData(new DateDb(183,"Яким був кількісний склад ворожого війська («Чи не той то хміль…»)","сорок тисяч","мільйон","кілька сотень","півтисячі"));
        dbHelpers.addData(new DateDb(184,"Тікаючи, поневолювачі погубили («Чи не той то хміль…»)","шуби","військові намети","особисті документи","ганчір’я"));
        dbHelpers.addData(new DateDb(185,"Скільки років невільники були у неволі? («Дума про Марусю Богуславку»)","30","33","10","50"));
        dbHelpers.addData(new DateDb(186,"Напередодні якого свята Маруся Богуславка захотіла визволити невільників?(«Дума про Марусю Богуславку»)","Великдень","Різдво","Трійця","Новий Рік"));
        dbHelpers.addData(new DateDb(187,"Ой, матінка плаче,\n" +
                "Поки жити буде.\n" +
                "А сестриця плаче,\n" +
                "Поки не забуде.\n" +
                "А миленька плаче,\n" +
                "Поки його бачить...\nузято з","балади","думи","історичної пісні","календарно-обрядової пісні"));
        dbHelpers.addData(new DateDb(188,"Удовин син загинув від стріли у творі","«Ой летіла стріла»","«Віють вітри»","«Ой Морозе, Морозенку»","«За світ встали козаченьки»"));
        dbHelpers.addData(new DateDb(189,"Мати, сестра та кохана у баладі «Ой летіла стріла» перетворилися на","зозульок","калину","квіти","русалок"));
        dbHelpers.addData(new DateDb(190,"Козаченьки вирушають в похід («Засвіт встали козаченьки»)","з полуночі","після сніданку","пообіді","увечері"));

        // TODO Давня українська література
        dbHelpers.addData(new DateDb(191,"Жанр «Повісті минулих літ»","літопис","роман","поема","історична пісня"));
        dbHelpers.addData(new DateDb(192,"Герої оповіді про заснування Києва перелічені в рядку"," Кий, Щек, Хорив","Ольга, Либідь, Ярославна","Святослав, Ігор, Всеволод","Святослав, Свенельд, Асмуд"));
        dbHelpers.addData(new DateDb(193,"Якому племені помстилась Ольга за вбивство чоловіка Ігоря?","деревлянам","половцям","сіверянам","хозарам"));
        dbHelpers.addData(new DateDb(194,"Автор «Слова про похід Ігорів»","Невідомий","Нестор Літописець","Григорій Сковорода","Іван Котляревський"));
        dbHelpers.addData(new DateDb(195,"Підготовка Ігоря з дружиною князів до військового походу, зловісні знаки - це","Експозиція","Розв'язка","Зав'язка","Кульмінація"));
        dbHelpers.addData(new DateDb(196,"Овлур, Гзак, Кончак - головні герої","Слово про похід Ігорів","Енеїда","Чорна Рада","Мойсей"));
        dbHelpers.addData(new DateDb(197,"Образом-символом Русі-України у «Слова про похід Ігорів» є","легендарний Боян","дружина Ігоря -Ярославна","Святослав","Ігор"));
        dbHelpers.addData(new DateDb(198,"Кого у «Слова про похід Ігорів» автор наділяє порівнянням \"Буй-тур\"?","Всеволода","Ігоря","Святослава","Володимира"));
        dbHelpers.addData(new DateDb(199,"Кому належать слова «О мої синовці,\n" +
                "Ігорю і Всеволоде!\n" +
                "Рано єсте почали Половецькую землю мечами разити,\n" +
                "а собі слави шукати.»","Святославу","Олегу","Ользі","Володимиру"));
        dbHelpers.addData(new DateDb(200,"Кого характеризує дана цитата: \"...підпер гори Угорськії своїми залізними полками, ...зачинив Дунаю ворота...\"","Осмомисла Галицького","Всеволода","князя Ігоря","князя Святослава"));
        dbHelpers.addData(new DateDb(201,"У «Слові про похід Ігорів» згадуються лише:","сонце і місяць","зірки","сонце і зірки","зірки і місяць"));
        dbHelpers.addData(new DateDb(202,"У похід Ігор рушив («Слово про похід Ігорів»)","ранньою весною","узимку","ранньої осені","пізнього літа"));
        dbHelpers.addData(new DateDb(203,"У дійсності Ярославну звали («Слово про похід Ігорів»)","Єфросинією","Єлизаветою","Ярославною","Анною"));
        dbHelpers.addData(new DateDb(204,"Хто віднайшов список «Слово про похід Ігорів» і вперше опублікував його текст?","О. Мусін-Пушкін","О. Пушкін","Ю. Миролюбов-Лядський","Алі Ізенбек"));
        dbHelpers.addData(new DateDb(205,"«Ізронив золоте слово»: ","Святослав","Ігор","Всеволод","Боян"));
        dbHelpers.addData(new DateDb(206,"Кого називають «сміливим соколом»","Ігоря","Олега","Володимира","Святослава"));
        dbHelpers.addData(new DateDb(207,"«De Libertate» починається з рядків","Що є свобода? Добро в ній якеє?","Всякому місту — звичай і права","Що на Чорному морі, На камені біленькому","Вольності отче, Богдане-герою!"));
        dbHelpers.addData(new DateDb(208,"Який гетьман згадується у творі «De Libertate»","Хмельницький","Апостол","Розумовський","Скоропадський"));
        dbHelpers.addData(new DateDb(209,"«Той, в кого совість як чистий кришталь» є ідеалом автора твору:","«Всякому місту – звичай і права» Григорія Сковороди","«Чого являєшся мені у сні» Івана Франка","«Послання до Основ’яненка» Тараса Шевченка","«І все-таки до тебе думка лине» Лесі Українки"));
        dbHelpers.addData(new DateDb(210,"Сатиричне зображення панів, чиновників, купців, дворянсько-бюрократичної системи управління зображено у філософсько-сатиричній поезії","«Всякому місту - звичай і права»","Мина Мазайло","Мартин Боруля","«Бджола та Шершень»"));
        dbHelpers.addData(new DateDb(211,"Жанр «Бджола та шершень»: ","байка","поема","літопис","історична пісня"));
        dbHelpers.addData(new DateDb(212,"Тема «сродної праці» присутня у творі","Г. Сковороди","Т. Шевченка","Л. Костенко","І. Франка"));
        dbHelpers.addData(new DateDb(213,"Узагальнений образ людей, що живуть грабунком інших і створені лише для того, щоб їсти й пити характерний для героя твору","«Бджола та Шершень»","«Всякому місту - звичай і права»","«Dе Ііbеrtatе»","«Слово про похід Ігорів»"));
        dbHelpers.addData(new DateDb(214,"«Мутен сон бачив у Києві на горах» герой «Слова про Ігорів похід»","Святослав","Олег","Ігор","Ярослав"));
        dbHelpers.addData(new DateDb(215,"4 сонця у «Слові про похід Ігорів» характеризують","князів - учасників походу","пори року","4 дні","полки Ігоря"));
        dbHelpers.addData(new DateDb(216,"Сон персонажа є елементом композиції твору","«Слово про похід Ігорів»","«Чорна Рада»","«Енеїда»","«Бджола та Шершень»"));
        dbHelpers.addData(new DateDb(217,"У рядках\n" +
                "\n" +
                "Бряжчить шабля о шолом,\n" +
                "Тріщать списи гартовані\n" +
                "В степу, в незнаємому полі,\n" +
                "Серед землі Половецької…\n" +
                "\n" +
                "Тарас Шевченко згадує події, зображені у творі","«Слово про похід Ігорів»","«Енеїда»","«Гайдамаки»","«Чорна рада»"));
        dbHelpers.addData(new DateDb(218,"Вислів «Випускає він десять соколів на стадо лебедів» («Слово про похід Ігорів») означає","гру на гуслях","затемнення сонця","бій між русичами і половцями","полювання на лебедів"));
        dbHelpers.addData(new DateDb(219,"«...Тут кривавого вина недостало; тут пир докінчили хоробрі русичі...», - так у «Слові про похід Ігорів» зображено","поразку Ігоря в бою з половцями","весілля князя Ігоря та Ярославни","епізод князівських міжусобиць","епізод князівських міжусобиць"));
        dbHelpers.addData(new DateDb(220,"Праця має стати природною потребою, «найсолодшою поживою». Тільки тоді життя матиме сенс і красу. В улюбленій справі людина щаслива, а в безділлі — деградує - мораль байки","«Бджола та Шершень»","«Всякому місту - звичай і права»","«Dе Ііbеrtatе»","«Катерина»"));

        // TODO Лі-ра другої половини 19 - початку 20 століття
        dbHelpers.addData(new DateDb(221,"Автор твору «Енеїда»","Іван Котляревський","Тарас Шевченко","Михайло Коцюбинський","Іван Франко"));
        dbHelpers.addData(new DateDb(222,"«Енеїда» за жанром – це…","бурлескно-травестійна поема","соціально-побутова поема","пригодницька поема","героїчна поема"));
        dbHelpers.addData(new DateDb(223,"Як називалося місто, у якому жила Дідона?","Карфаген","Сицилія","Троя","Рим"));
        dbHelpers.addData(new DateDb(224,"«Енеїда» І. Котляревського є переробкою твору","Вергілія","Гомера","Есхіла","Софокла"));
        dbHelpers.addData(new DateDb(225,"Який персонаж твору «Наталка Полтавка» Івана Котляревського погрожує:\n" +
                "\n" +
                "«…притягти до відповідальності дівчину, яка відмовилася одружуватися з ним»?","Возний","Петро","Виборний","Микола"));
        dbHelpers.addData(new DateDb(226,"Яку приказку наводила Наталка возному? («Наталка Полтавка»)","Знайся кінь з конем, а віл з волом","Попри двох і третій влізе","Без одної крупи горщик повний буде","Удвох, кажуть люди, легше плакати неначе"));
        dbHelpers.addData(new DateDb(227,"Жанр «Наталки Полтавки» за словами Котляревського","опера","поема","повість","роман"));
        dbHelpers.addData(new DateDb(228,"Який твір Іван Карпенко-Карий назвав «праматір’ю українського народного театру»","Наталка Полтавка","Енеїда","Маруся","Кайдашева сім'я"));
        dbHelpers.addData(new DateDb(229,"З якої пісні починається «Наталка Полтавка»","«Віють вітри»","«Всякому місту - звичай і права»","«Ой летіла стріла»","«Чи не той то хміль…»"));
        dbHelpers.addData(new DateDb(230,"«Катерину» Т. Шевченко присвятив...","В В. Жуковському","Карлу Брюллову","Своїм сестрам","Якову де Бальмену"));
        dbHelpers.addData(new DateDb(231,"Зображення загарбницької політики російського імперіалізму - тема твору","«Кавказ»","«Чорна Рада»","«Я (Романтика)»","«Енеїда»"));
        dbHelpers.addData(new DateDb(232,"«Борітеся — поборете!» — заклик до об’єднання зусиль народів для боротьби проти спільного ворога покладено у ідею твору","«Кавказ»","«Катерина»","«Сон»","«Заповіт»"));
        dbHelpers.addData(new DateDb(233,"Учітесь, читайте, /І чужому научайтесь, / Й свого не цурайтесь - афоризм із твору","«І мертвим, і живим, і ненарожденним…»","«Кавказ»","«Катерина»","«Заповіт»"));
        dbHelpers.addData(new DateDb(234,"Доба Руїни є історичним тлом твору","«Чорна рада»","«Я (Романтика)»","«Мойсей»","«Кавказ»"));
        dbHelpers.addData(new DateDb(235,"Автор першого історичного роману в українській літературі","Пантелеймон Куліш","Тарас Шевченко","Іван Нечуй-Левицький","Іван Котляревський"));
        dbHelpers.addData(new DateDb(236,"У якому році відбуваються події?(«Чорна рада»)","1663","1841","1912","1617"));
        dbHelpers.addData(new DateDb(237,"Історичним джерелом, використаним П. Кулішем у сюжеті роману «Чорна рада», став:","Літопис Самовидця","Літопис Самійла Величка","«Київський літопис»","«Галицько-Волинський літопис»"));
        dbHelpers.addData(new DateDb(238,"Визначте жанр твору І. Нечуя-Левицького «Кайдашева сім’я»","реалістична соціально-побутова сатирично-гумористична повість"," соціально-психологічний роман","соціально-побутовий роман","реалістична соціально-психологічна повість"));
        dbHelpers.addData(new DateDb(239,"І. Нечуй-Левицький зосереджує основну увагу у творі «Кайдашева сім’я» на","сім’ї як осередку суспільства","нещасливій долі українського народу","коханні","показі важливих історичних подій"));
        dbHelpers.addData(new DateDb(240,"Яка реальна сім’я була прототипом Кайдашевої?","Мазурів","Кайдашів;","Довбишів","Балашів"));
        dbHelpers.addData(new DateDb(241,"Укажіть, хто з персонажів «Кайдашевої сім’ї» в кульмінаційний момент промовляє: «По спині лупи її. Виколи дрючком їй друге око!»","Мотря","Карпо","Лаврін","Мелашка"));
        dbHelpers.addData(new DateDb(242,"Кому належать слова: “А ти хотіла згорнути руки та й сидіти? Чого це ти розходилася? Та я тобі не подивлюся в зуби”?","Кайдашиха","Лаврін","Карпо","Мелашка"));
        dbHelpers.addData(new DateDb(243,"Справжнє прізвище Панаса Мирного","Рудченко","Губенко","Тобілевич","Левицький"));
        dbHelpers.addData(new DateDb(244,"Сюжетною основою для написання роману «Хіба ревуть воли, як ясла повні?» Панаса Мирного та Івана Білика став нарис","«Подоріжжя от Полтави до Гадячого»","«Чіпка»","Пропаща сила","Лихі люди"));
        dbHelpers.addData(new DateDb(245,"Прізвища Хрущ, Хрущов, Притика в романі «Хіба ревуть воли, як ясла повні?» мав (мали)","Іван Вареник","Матня, Лушня й Пацюк","Чіпка Варениченко","Дід Улас"));
        dbHelpers.addData(new DateDb(246,"Хто є співавтором, роману «Хіба ревуть воли, як ясла повні?»","Іван Білик","Іван Франко","Іван Нечуй-Левицький","Іван Карпенко-Карий"));
        dbHelpers.addData(new DateDb(247,"Яку назву мав роман «Хіба ревуть воли, як ясла повні?» при перевиданні в Україні 1903 р.?","«Пропаща сила»"," «Чіпка»","«Подоріжжя од Полтави до Гадячого»","«Кріпацька неволя»"));
        dbHelpers.addData(new DateDb(248,"Укажіть, кого з персонажів роману «Хіба ревуть воли, як ясла повні?» названо «польовою царівною»","Дочку Максима Галю","дружину Максима Явдоху","дружину Грицька Христю","матір Чіпки Мотрю"));
        dbHelpers.addData(new DateDb(249,"Кого в романі «Хіба ревуть воли, як ясла повні?» названо «двужоном»","Івана Вареника","Чіпку Вареничеяка","Максима Ґудзя","Грицька Чунруненка"));
        dbHelpers.addData(new DateDb(250,"Визначте розв’язку твору «Хіба ревуть воли, як ясла повні?»","Мотря видає властям сина-убивцю, і його відправляють на каторгу","у Чіпки незаконно одбирають землю","Чіпка одружується з Галею і кидає розбій","Чіпка сходиться з волоцюгами Лушнею, Матнею, Пацюком"));
        dbHelpers.addData(new DateDb(251,"Яка з чотирьох частин є екскурсом в минуле?","Частина ІІ","Частина І","Частина ІІІ","Частина ІV"));
        dbHelpers.addData(new DateDb(252,"Назвіть героїню: «…весела, моторна, працьовита. Вона була сиротою, невеликої вроди, але так запала в серце, що забув і про великий посаг, і про незвичайну красу майбутньої жінки»?","Христя","Мотря","Оришка","Галя"));
        dbHelpers.addData(new DateDb(253,"Зображення на широкому суспільному тлі життєпису злочинця Чіпки від його народження до ув’язнення на каторгу це тема твору","«Хіба ревуть воли, як ясла повні»","«Мартин Боруля»","«Чорна Рада»","«Кайдашева сім'я»"));
        dbHelpers.addData(new DateDb(254,"Справжнє прізвище І. Карпенка-Карого ","І.К.Тобілевич","П.Рудченко","М.Хвильовий","І.Багряний"));
        dbHelpers.addData(new DateDb(255,"За жанром твір І.Карпенка-Карого «Мартин Боруля» -","трагікомедія","комедія","драма","водевіль"));
        dbHelpers.addData(new DateDb(256,"З ким у Мартина Борулі виник конфлікт через те, що його назвали «бидлом», а сина – «телям»?","з Красовським","з Трандалєвим","з Націєвським","з Гуляницьким"));
        dbHelpers.addData(new DateDb(257,"На якому інструменті грав Націєвський?","на гітарі","на скрипці","на арфі","на сопілці"));
        dbHelpers.addData(new DateDb(258,"Скільки часу справа Мартина Борулі знаходилася в сенаті?","шостий місяць","третій рік","другий тиждень","кілька днів"));
        dbHelpers.addData(new DateDb(259,"«Поки був чоловіком, не вередував, а паном зробили – чорт тепер на нього потрапе», - сказано про Мартина Борулю","Омельком","Степаном","Миколою","Палажкою"));
        dbHelpers.addData(new DateDb(260,"Що, крім коней, в Омелька вкрали в місті?","чоботи й кобеняк","плахту й черес","кунтуш і ліврею","намітку й очкур"));
        dbHelpers.addData(new DateDb(261,"Яку дворянську роботу Мартин придумав для Марисі?","вишивати","прясти","прати","куховарити"));
        dbHelpers.addData(new DateDb(262,"Після підслуханого діалогу між батьками Марисі про кумів Націєвcький","тікає із власних заручин","просить збільшити придане","дорікає Марисі за обман","висловлює власне побажання"));
        dbHelpers.addData(new DateDb(263,"В якому році відбуваються події твору? («Захар Беркут»)","1241 року","1333 року","1829 року","1567 року"));
        dbHelpers.addData(new DateDb(264,"Хто такий Тугар Вовк?","тухольський боярин","галицький князь","тухольський радник","київський боярин"));
        dbHelpers.addData(new DateDb(265,"Як звали Тугарову доньку?","Мирослава","Ольга","Анна","Софія"));
        dbHelpers.addData(new DateDb(266,"Про кого сказано: «… мужчина як дуб. Плечистий, підсадкуватий, з грубими обрисами лиця і грубим, чорним волоссям, він і сам подобав на одного з тих злющих тухольських медведів, яких їхав воювати»?","Тугара Вовка","Захара Беркута","князя Данила","Максима Беркута"));
        dbHelpers.addData(new DateDb(267,"Від якого дикого звіра допоміг Максим врятуватися Мирославі?(«Захар Беркут»)","ведмедя","лева","кабана","вовка"));
        dbHelpers.addData(new DateDb(268,"Хто має владу у Тухлі, за словами Максима?(«Захар Беркут»)","Громада","Захар Беркут","Максим Беркут","князь Данило"));
        dbHelpers.addData(new DateDb(269,"Чому Тугар Вовк відмовлявся йти на копу – раду?","Вважав принизливим слухатися смердів","далеко було їхати","повинен був їхати на раду до князя","боявся залишати свою дочку вдома саму"));
        dbHelpers.addData(new DateDb(270,"Який знак подавали тухольці перед початком ради?","піднімали копне знамено вгору і встромляли в дірку, продовбану в камені","підкидали шапки високо вгору","закидали копне знамено у спеціально вириту яму","Тричі обходили тотем, при цьому піднявши вгору копне знамено"));
        dbHelpers.addData(new DateDb(271,"Чим займався Захар Беркут?","садом, пасікою та ліками","садом, лісом, городом","городом, пасікою, садом","лісом, городом, ліками"));
        dbHelpers.addData(new DateDb(272,"Що являло собою знамено тухольців?(«Захар Беркут»)","ланцюг","статуя","палиця","намисто"));
        dbHelpers.addData(new DateDb(273,"Що дратувало монголо-татар, коли вони набігли на Тухлю?","що хати були пусті","що люди обороняли свої домівки","що в селі залишилися самі жінки та діти","що ішла сильна злива"));
        dbHelpers.addData(new DateDb(274,"Кого у творі названо «псом блідолицим» та «подвійним зрадником» («Захар Беркут»)","Тугара Вовка","Максима Беркута","Захара Беркута","Чінгісхана"));
        dbHelpers.addData(new DateDb(275,"Кого названо «старим чарівником, який знає таке слово, що кожному до серця трафляє»?(«Захар Беркут»)","Захара Беркута","Тугара Вовка","Максима Беркута","Бурунду-бегадира"));
        dbHelpers.addData(new DateDb(276,"Страждання ліричного героя через нерозділене кохання - провідний мотив твору","«Чого являєшся мені у сні?..»","«Кавказ»","«Віють вітри»","«Хіба ревуть воли, як ясла повні?»"));
        dbHelpers.addData(new DateDb(277,"Автор твору «Мартин Боруля» є також автором","«Чого являєшся мені у сні?..»","«Хіба ревуть воли, як ясла повні?»","«Мартин Боруля»","«Наталка-Полтавка»"));
        dbHelpers.addData(new DateDb(278,"Твір «Мойсей» належить до літературного напряму","модернізм","реалізм","класицизм","романтизм"));
        dbHelpers.addData(new DateDb(279,"За жанром твір «Мойсей»","філософська ліро-епічна поема","історико-героїчна поема","соціально-побутова поема","психологічна драма"));
        dbHelpers.addData(new DateDb(280,"Скільки років блукав Мойсей зі своїм народом по Аравійській пустелі?","40 років","43 роки","50 років","33 роки"));
        dbHelpers.addData(new DateDb(281,"Пролог до поеми «Мойсей» звучить як","заповіт українському народові","звернення до українського народу","заповіт єврейському народові","звернення до єврейського народу"));
        dbHelpers.addData(new DateDb(282,"У поемі «Мойсей» використано сюжет","біблійний","давньогрецький","давньоримський","давньоєгипетський"));
        dbHelpers.addData(new DateDb(283,"На шляху до високої мети Мойсею перешкоджають дрібні людці","Авірон і Датан","Єгошуа і Єгова","Азазель і Єгова","єврейський народ"));
        dbHelpers.addData(new DateDb(284,"Азазель у поемі «Мойсей» — це","темний демон пустелі","пророк","кочівник","князь конюхів"));
        dbHelpers.addData(new DateDb(285,"«…Се дідусь слабосилий,\n" +
                "Що без роду, без стад і жінок\n" +
                "Сам стоїть край могили.\n" +
                "Все, що мав у життю, він віддав\n" +
                "Для одної ідеї…»\n" +
                "\n" +
                "У цьому уривку йдеться про","Мойсея","Датана","Єгошуа","Авірона"));
        dbHelpers.addData(new DateDb(286,"Вірш «Чого являєшся мені у сні?..» І. Франка написаний у формі","монологу","діалогу","молитви","сповіді"));
        dbHelpers.addData(new DateDb(287,"Головна ідея поеми «Мойсей» — це","заклик вірити у свій народ, позбутися рабської психології й будувати нове життя","оспівування славного минулого єврейського народу","засудження молодого покоління через його недалекоглядність","засудження пророка за недотримання даного народові слова"));
        dbHelpers.addData(new DateDb(288,"Намагається підірвати віру Мойсея","Азазель","Єгова","Датан","Єгошуа"));
        dbHelpers.addData(new DateDb(289,"Карає пророка за сумнів («Мойсей»)","Єгова","Авірон","Азазель","Мойсей"));
        dbHelpers.addData(new DateDb(290,"До композиційних особливостей поеми «Мойсей» належать","пролог, двадцять пісень","чотири частини, епілог","зміщення часових площин, рефрен","розлогі пейзажі, інтер’єри"));

        // TODO Лі-ра 20 століття
        dbHelpers.addData(new DateDb(291,"У повісті «Тіні забутих предків» змальовано такий регіон України","Гуцульщина","Волинь","Буковина","Галичина"));
        dbHelpers.addData(new DateDb(292,"Мати Іванова боялася його і одвертала від нього очі, бо («Тіні забутих предків»)","думала, що він бісове дитя","син був дуже хворобливим","хлопчик ображав матір","Іван був дуже негарним"));
        dbHelpers.addData(new DateDb(293,"Марічка при першій зустрічі з Іваном («Тіні забутих предків»)","пригостила цукеркою","дражнила його","подарувала йому сопілку","почала битися з ним"));
        dbHelpers.addData(new DateDb(294,"Щастю Івана і Марічки завадило («Тіні забутих предків»)","родова ворожнеча","соціальна нерівність","нерозділене кохання","Іванова зрада"));
        dbHelpers.addData(new DateDb(295,"Про які два роди розповідається у творі («Тіні забутих предків»)","Гутенюки та Палійчуки","Гутенюки та Кайдаші","Палійчуки та Кайдаші","Запорожці та Гутенюки"));
        dbHelpers.addData(new DateDb(296,"Зображення життя гуцулів на межі ХІХ-ХХ ст.; відтворення поетичного світу давніх гуцульських традицій, міфологічного світосприйняття і світовідчуття гуцулів; сильних і нестримних почуттів; органічної єдності з природою - тема твору","«Тіні забутих предків»","«Лісова пісня»","«Кайдашева сім'я»","«Наталка-Полтавка»"));
        dbHelpers.addData(new DateDb(297,"Де розгортаються події новели М.Коцюбинського \"Intermezzo\"?","На Кононівських полях","На тлі лісових пейзажів","На міських вулицях","У душі ліричного героя"));
        dbHelpers.addData(new DateDb(298,"Кому(Чому) присвячена новела М.Коцюбинського \"Intermezzo\"","Кононівським полям","Цвітові яблунь","Любові Всевишній","Якову де Бальмену"));
        dbHelpers.addData(new DateDb(299,"Події в новелі «Камінний хрест» В. Стефаника відбуваються","наприкінці XIX — на початку XX ст.","після скасування кріпосного права","під час Першої світової війни","за часів кріпаччини"));
        dbHelpers.addData(new DateDb(300,"Символом розпачу від прощання з рідним краєм у новелі «Камінний хрест» є","танець","горб","хрест","камінь"));
        dbHelpers.addData(new DateDb(301,"Темою новели «Камінний хрест» В. Стефаника є","еміграція західноукраїнської родини","смерть селянина від тяжкої праці на землі","тяжке життя селян в умовах кріпацтва","доля жінки-матері в еміграції"));
        dbHelpers.addData(new DateDb(302,"За основу твору «Камінний хрест» автор узяв…","факт із життя Штефана Дідуха із с.Русова","розповіді емігрантів","історію Василя Гнидки","вигадану  історію"));
        dbHelpers.addData(new DateDb(303,"Важка праця зігнула Івана Дідуха в дугу, то в селі його називали","«Переламаний»","«Зігнутий»","«Поламаний»","«Каліка»"));
        dbHelpers.addData(new DateDb(304,"Камінний хрест, горб, прізвище Дідух – це у творі …","образи-символи","художні засоби","зорові образи","слухові образи"));
        dbHelpers.addData(new DateDb(305,"Коли покидали село, Іван Дідух показував старій хрест зі словами: ","Там є вибито і твоє намено...є і моє, і твоє","На новому місці заживемо краще","Не хвилюйся, повернемося на цю землю","Не журися, хоч дітям буде щастя"));
        dbHelpers.addData(new DateDb(306,"Жанр «Valse Melancolique»:","музична новела","роман","оповідання","повість"));
        dbHelpers.addData(new DateDb(307,"Музика — центральний образ твору","«Valse Melancolique»","«Хіба ревуть воли, як ясла повні?»","«Наталка-Полтавка»","«Dе Ііbеrtatе»"));
        dbHelpers.addData(new DateDb(308,"Утвердження думки про вільний вибір жінкою свого життєвого шляху та необхідність створення умов для її самореалізації - ідея твору","«Valse mélancolique»","«Dе Ііbеrtatе»","«Іntermezzo»","«Чорна рада»"));
        dbHelpers.addData(new DateDb(309,"Рядки\n" +
                "\n" +
                "Я на вбогім сумнім перелозі\n" +
                "Буду сіять барвисті квітки,\n" +
                "Буду сіять квітки на морозі,\n" +
                "Буду лить на них сльози гіркі\n" +
                "\n" +
                "написано:","Лесею Українкою","Тарасом Шевченком","Миколою Вороним","Максимом Рильським"));
        dbHelpers.addData(new DateDb(310,"Уривок із листа «От і знов берусь здіймати «сізіфовий камінь» догори!… Чи підійметься? Навряд — не такий то камінь!» перегукується з óбразами та мотивами вірша:","«Contra spem spero!»","«Стилет чи стилос?»","«О слово рідне! Орле скутий!..»","«Молюсь і вірю...»"));
        dbHelpers.addData(new DateDb(311,"Косач – це справжнє прізвище автора твору:","«Contra spem spero!»","«Чари ночі»","«Чари ночі»","«Intermezzo»"));
        dbHelpers.addData(new DateDb(312,"У словах Лесі Українки «Я на гору круту крем’яную / Буду камінь важкий підіймать…» переосмислено образ:","Сізіфа","Геракла","Енея","Прометея"));
        dbHelpers.addData(new DateDb(313,"Назва вірша «Contra spem spero!» перекладається з латини як","без надії сподіваюсь","через терни до зірок","надія помирає остання","із надією живу"));
        dbHelpers.addData(new DateDb(314,"Яке дерево на початку «Лісової пісні» Лукаш хоче надрізати ножем, щоб сточити сік, але його зупиняє Мавка?","березу","вербу","калину","смереку"));
        dbHelpers.addData(new DateDb(315,"«Лісова пісня» за жанром","драма-феєрія","трагікомедія","водевіль","драма-фантазія"));
        dbHelpers.addData(new DateDb(316,"На вовкулаку Лукаша перетворив («Лісова пісня»)","лісовик","марище","водяний","перелесник"));
        dbHelpers.addData(new DateDb(317,"Автор твору «Блакитна Панна»","Вороний","Франко","Олесь","Стефаник"));
        dbHelpers.addData(new DateDb(318,"І уже в душі моїй\n" +
                "В сяйві мрій\n" +
                "В’ються хмелем арабески,\n" +
                "Миготять камеї, фрески,\n" +
                "Гомонять-бринять пісні\n" +
                "Голосні\n" +
                "І сплітаються в гротески\nуривок з твору","«Блакитна Панна»","«Соntra spem spero!»","«Іntermezzo»","«Хіба ревуть воли, як ясла повні?»"));
        dbHelpers.addData(new DateDb(319,"Захоплення красою життя і красою кохання - мотиви інтимної лірики","«Чари ночі»","«Блакитна Панна»","«Ви знаєте, як липа шелестить…»","«О, панно Інно...»"));
        dbHelpers.addData(new DateDb(320,"Сміються, плачуть солов'ї\n" +
                "І б'ють піснями в груди:\n" +
                "\"Цілуй, цілуй, цілуй її, —\n" +
                "Знов молодість не буде!\nуривок з твору","«Чари ночі»","«Любіть Україну!»","«Пісня про рушник»","«Заповіт»"));
        dbHelpers.addData(new DateDb(321,"Щире захоплення рідним словом; гнівне картання тих, хто його нищить і зневажає; заклик любити й берегти рідне слово це мотив твору","«О слово рідне! Орле скутий!..»","«О, панно Інно...»","«Іntermezzo»","«Ти знаєш, що ти - людина...»"));
        dbHelpers.addData(new DateDb(322,"Вірш присвячений першому коханню юного Тичини до Поліни Коновал, але оскільки дівчина не відповіла взаємністю, він, переживши нерозділене кохання, пише вірш і дарує Поліниній сестрі Інні","«О, панно Інно...»","«Ви знаєте, як липа шелестить…»","«Пам’яті тридцяти»","«Чари ночі»"));
        dbHelpers.addData(new DateDb(323,"У вірші «Пам’яті тридцяти» згадуються події","кривавого наступу більшовиків, 1918 р.","Коліївщини, 1768 р. ","доби Руїни, 1663 р.","скасування Запорозької Січі, 1775 р."));
        dbHelpers.addData(new DateDb(324,"Де поховали тридцять мучнів українців згідно до віршу «Пам’яті тридцяти»","на Аскольдовій могилі","під Черніговом","біля річки Десна","в с. Піски на Чернігівщині"));
        dbHelpers.addData(new DateDb(325,"Автор інтимної лірики «Ви знаєте, як липа шелестить…» є ","Павло Тичина","Максим Рильський","Олександр Олесь","Володимир Сосюра"));
        dbHelpers.addData(new DateDb(326,"Ви знаєте, як сплять старі гаї?\n" +
                "Вони все бачать крізь тумани.\n" +
                "Ось місяць, зорі, солов’ї…\n" +
                "«Я твій» — десь чують дідугани.\n" +
                "А солов’ї!…\n" +
                "Та ви вже знаєте, як сплять гаї!\nуривок з твору","«Ви знаєте, як липа шелестить…»","«Пам’яті тридцяти»","«Чого являєшся мені у сні?..»","«Балада про соняшник»"));
        dbHelpers.addData(new DateDb(327,"Справжнє прізвище Миколи Хвильового…","Фітільов","Губенко","Очерет","Лозов’ягін"));
        dbHelpers.addData(new DateDb(328,"Психологічна новела «Я (Романтика)» М. Хвильового присвячена…","«цвітові яблуні»","«кононівським полям»","«своїй матері»","«загірній комуні»"));
        dbHelpers.addData(new DateDb(329,"«…З далекого туману, тихих озер загірної комуни шелестить шелест: то йде Марія» починається твір М. Хвильового…","«Я (Романтика)»","«Сентиментальна історія»","«Сині етюди»","«Мати»"));
        dbHelpers.addData(new DateDb(330,"У словах «Я – чекіст, але і людина» автор новели «Я (Романтика)» розкриває проблему…","внутрішнє роздвоєння особистості, породженого надмірним  фанатизмом","стосунками батьків з дітьми","життєвого вибору людини","нерозуміння персонажем власного «Я»"));
        dbHelpers.addData(new DateDb(331,"Мати в новелі  «Я (Романтика)» називала свого сина…","м’ятежним сином","чекістом","комунаром","фанатиком загірної комуни"));
        dbHelpers.addData(new DateDb(332,"У новелі  «Я (Романтика)» главкомверх  чорного трибуналу вступає в конфлікт з… ","власною совістю","Андрюшею","доктором Тагабатом","матір’ю"));
        dbHelpers.addData(new DateDb(333,"Засідання чорного трибуналу новели «Я (Романтика)» відбувається…","у будинку розстріляного шляхтича","у міській лікарні","у загірній комуні","на залізничному вокзалі"));
        dbHelpers.addData(new DateDb(334,"Укажіть персонажа новели «Я (Романтика)» за портретом. «… із широким лобом і білою лисиною, з холодним розумом і каменем замість серця»… ","доктор Тагабат","дегенерат","я","Андрюша"));
        dbHelpers.addData(new DateDb(335,"Укажіть персонажа новели «Я (Романтика)» (…не ім’я і прізвище на суворому життєвому документі ставить, а зовсім незрозумілий химерний, як хетейський ієрогліф хвостик»…","Андрюша","дегенерат","доктор Тагабат","я"));
        dbHelpers.addData(new DateDb(336,"«Це сторож моєї душі» говорить Я в новелі «Я (Романтика)»  про… ","доктора Тагабата","рідну матір","Божу Матір","вірного вартового із дегенеративною будовою черепа"));
        dbHelpers.addData(new DateDb(337,"«Я (Романтика)» за жанром – це","новела","роман","повість","драма"));
        dbHelpers.addData(new DateDb(338,"Кого (що) герой називає «новий синедріон»?  «Я (Романтика)»","чорний трибунал комуни","Біблію","палац розстріляного шляхтича","монархічний лад"));
        dbHelpers.addData(new DateDb(339,"Який «злочин» нібито вчинила мати героя (за що її засуджено)?  «Я (Романтика)»","разом із черницями вела «одверту агітацію проти комуни»","прокляла Сталіна","стверджувала, що «комуною є Бог»","відмовилася зректися релігії"));
        dbHelpers.addData(new DateDb(340,"Яким псевдонімом Юрій Яновський підписав свою першу поезію?","Георгій Ней","Юрій Майоров","Георгій Яновський","Юрій Юрченко"));
        dbHelpers.addData(new DateDb(341,"«Любіть Україну!» має форму","послання","монологу","діалогу","полілогу"));
        dbHelpers.addData(new DateDb(342,"Патріотичний вірш, написаний у 1944 р., у 1951 р. став причиною найгостріших звинувачень поета в націоналізмі","«Любіть Україну»","«Пісня про рушник»","«Кавказ»","«Іntermezzo»"));
        dbHelpers.addData(new DateDb(343,"Степан Радченко добирався із села до Києва …","пароплавом","потягом","пішки","кіньми"));
        dbHelpers.addData(new DateDb(344,"Радченко  їхав до великого міста …","вчитися в інституті","працювати на заводі","побачитися з родичами","на педкурси"));
        dbHelpers.addData(new DateDb(345,"Нове Степанове життя почалося у … («Місто»)","столярні","кухні","корівнику","кладовій"));
        dbHelpers.addData(new DateDb(346,"Михайло Світозаров – це … («Місто»)","найголовніший критик","відомий поет","інститутський друг Степана","голова КУБУЧу"));
        dbHelpers.addData(new DateDb(347,"Коли вперше Степан вирішив, що мусить стати письменником?(«Місто»)","після літературної вечірки","коли читав літературний журнал","після вступу в інститут","Ще по дорозі в Київ"));
        dbHelpers.addData(new DateDb(348,"Перше оповідання Степана Радченка мало назву …","«Бритва»","«Перо»","«Чаша»","«Брама»"));
        dbHelpers.addData(new DateDb(349,"Перша посада Степана - …  («Місто»)","лектор","секретар","директор","продавець у книгарні"));
        dbHelpers.addData(new DateDb(350,"Степан і Зоська вперше зустрілися … («Місто»)","на концерті","на вулиці","у Задорожнього","на літературній вечірці"));
        dbHelpers.addData(new DateDb(351,"У «хвилини душевного затишку» Степан  любив … («Місто»)","прибирати у кімнаті","мріяти","блукати містом","читати любовні романи"));
        dbHelpers.addData(new DateDb(352,"«Жінка мала спокійне, майже нерухоме довгасте обличчя, що в прямокутній рамці гладенького стриженого волосся з рівним пасмом над очима нагадувало щось старовинне, витончене і застигле…» - це портрет («Місто»)","Рити","Зоськи","Надійки","Тамари Василівни"));
        dbHelpers.addData(new DateDb(353,"Від Рити Степан дізнався, що вона («Місто»)","танцює в балеті","знімається в кіно","грає в оркестрі","ніде не працює"));
        dbHelpers.addData(new DateDb(354,"«Мале на зріст – йому якраз під пахви, в плескуватому капелюшкові…Вона зиркнула спідлоба на юнака, руку свою прибрала і йшла далі своїм чітким, майже військовим кроком» - це («Місто»)","Зоська","Рита","Мусінька","Надійка"));
        dbHelpers.addData(new DateDb(355,"«Історичною здохлятиною» Вигорський називав","Київ","село","Поділ","окраїну міста"));
        dbHelpers.addData(new DateDb(356,"Жінки в житті Степана Радченка з’являлися в такій послідовності:","Надійка – Мусінька – Зоська – Рита","Зоська – Мусінька – Рита – Надійка","Мусінька – Надійка – Зоська – Рита","Надійка – Рита – Зоська – Мусінька"));
        dbHelpers.addData(new DateDb(357,"За жанром роман «Місто» -","урбаністичний","історичний","пригодницький","соціально-побутовий"));
        dbHelpers.addData(new DateDb(358,"Вислів «Як можна бути вільним, Евкріте, коли ти маєш тіло?» у романі «Місто» є ","епіграфом до твору","реченням із оповідання Степана","реплікою Світозарова","думкою Вигорського"));
        dbHelpers.addData(new DateDb(359,"Справжнє прізвище Остапа Вишні","Губенко","Фітільов","Тобілевич","Кандиба"));
        dbHelpers.addData(new DateDb(360,"У назві гуморески «Моя автобіографія» використано","тавтологію","фразеологізм","епітет","інверсію"));
        dbHelpers.addData(new DateDb(361,"Події в усмішці «Сом» відбуваються на річці","Оскіл","Буг","Дунай","Дністер"));
        dbHelpers.addData(new DateDb(362,"Головною темою «Моєї автобіографії» є розповідь про","формування світогляду письменника","політичну ситуацію в радянській Україні","громадянську активність автора","літературні уподобання гумориста"));
        dbHelpers.addData(new DateDb(363,"Велику ковбаню в річці герой-оповідач («Сом») вимірює","дзвіницею з хрестом","паровим катером","великим сомом","панським собакою"));
        dbHelpers.addData(new DateDb(364,"До якого літературного роду належить переважна більшість творів Миколи Куліша?","драма","епос","лірика","ліро-епос"));
        dbHelpers.addData(new DateDb(365,"До якого жанру М. Куліш відніс свій твір «Мина Мазайло»?","сатирична комедія","трагікомедія","трагедія","мелодрама"));
        dbHelpers.addData(new DateDb(366,"Якого(ку) героя(їню) п’єси М.Куліша «Мина Мазайло» терміново викликали з Курська, тому що Мокій «збожеволів від укрмови»","Мотрону Розторгуєву","дядька Тараса","Баронову-Козино","Улю Розсоху"));
        dbHelpers.addData(new DateDb(367,"Своє ставлення до української мови (з байдужого на прихильне) з часом змінює","Уля","Рина","тьотя Мотя","Баронова-Козино"));
        dbHelpers.addData(new DateDb(368,"Репліка Тільки що під’їхали до вокзалу, дивлюсь — отакими великими літерами: «Харків». Дивлюсь — не «Харьков», а «Харків»! Нащо, питаюсь, навіщо ви нам іспортілі город? належить","тьоті Моті","Рині","Бароновій-Козино","Мині Мазайлу"));
        dbHelpers.addData(new DateDb(369,"Характеристикою …очі, рот, стан — все чисто українське Мокій наділяє («Мина Мазайло»)","Улю","Рину","дядька Тараса","Мину Мазайла"));
        dbHelpers.addData(new DateDb(370,"Події, зображені в комедії «Мина Мазайло», відбуваються в","Харкові 20-х років XX ст.","Харкові під час «хрущовської відлиги»","революційному Харкові","Києві 20-х років XX ст."));
        dbHelpers.addData(new DateDb(371,"Факт народження Христа є темою твору","«Різдво»","«Іntermezzo»","«І мертвим, і живим, і ненарожденним…»","«Чари ночі»"));
        dbHelpers.addData(new DateDb(372,"Прийшли лемки у крисанях\n" +
                "і принесли місяць кругли\nрядки з твору","«Різдво»","«Ти знаєш, що ти - людина...»","«Пісня про рушник»","«Два кольори»"));
        dbHelpers.addData(new DateDb(373,"Чий це портрет:\n" +
                "Він був високий і худий, і чоло в нього високе, хвилясте довге волосся сиве, а борода біла. І була в нього велика грижа ще з молодих чумацьких літ. («Зачарована Десна»)","Діда Семена","Батька","Прадіда Тараса","Олександра Довженка"));
        dbHelpers.addData(new DateDb(374,"Як звали матір Сашка? («Зачарована Десна»)","Одарка","Горпина","Марина","Уляна"));
        dbHelpers.addData(new DateDb(375,"Куди ховався малий Сашко від прокльонів прабаби Марусини? («Зачарована Десна»)","у тютюн","у соняшники","у кукурудзу","у малину"));
        dbHelpers.addData(new DateDb(376,"А. Малишка називають","«солов’їним серцем України»","«поетом дальніх небосхилів»","«співцем материнської пісні»","«поетом залізних строф»"));
        dbHelpers.addData(new DateDb(377,"Рідна мати моя, ти ночей не доспала,\n" +
                "Ти водила мене у поля край села,\n" +
                "І в дорогу далеку ти мене на зорі проводжала,\n" +
                "І рушник вишиваний на щастя дала.\nуривок з твору","«Пісня про рушник»","«Задивляюсь у твої зіниці»","«Чари ночі»","«Ой летіла стріла»"));
        dbHelpers.addData(new DateDb(378,"«Ти знаєш, що ти — людина?», «Ти знаєш про це чи ні?» це ","Риторичні запитання","Риторичні оклики","Епітети","Повтори"));
        dbHelpers.addData(new DateDb(379,"Материнська тривога за долю сина, перед яким відкривається дійсність, — головний мотив поезії В. Симоненка:","«Лебеді материнства»","«Ти знаєш, що ти — людина…»","«Світ який! Мереживо казкове…»","«Чари ночі»"));
        dbHelpers.addData(new DateDb(380,"Про кого (що) йдеться у творі «Задивляюсь у твої зіниці…»?","про Україну","про кохану","про матір","про поезію"));
        dbHelpers.addData(new DateDb(381,"Мотив мови як генетичного коду нації; висловлення почуття любові, пошани до рідної мови, яка проспівана у Пісні, записана у Літописі є темою вірша, де автор","Василь Голобородько","Василь Симоненко","Олександр Довженко","Павло Тичина"));
        dbHelpers.addData(new DateDb(382,"Радянський (безіменний) боєць-розвідник, його напарник Ілля, словацька дівчина Тереза, Терезина мати це головні герої твору","«Модри камінь»","«Я (Романтика)»","«Чорна рада»","«Мина Мазайло»"));
        dbHelpers.addData(new DateDb(383,"У новелі «Три зозулі з поклоном» Гр. Тютюнника розповідь ведеться від","першої особи","другої особи","третьої особи","різних осіб залежно від епізоду"));
        dbHelpers.addData(new DateDb(384,"Новела «Три зозулі з поклоном» присвячена","любові всевишній","кононівським полям","Україні","сестрі"));
        dbHelpers.addData(new DateDb(385,"Назва новели «Три зозулі з поклоном» символізує","любовний трикутник — три долі головних героїв","три роки ув’язнення в таборах Сибіру","смуток, тужливу звістку, тугу за життям, минулим","плинність життя й кохання"));
        dbHelpers.addData(new DateDb(386,"Григір Тютюнник відомий в українській літературі як","майстер психологічної новели","поет-пісняр","байкар","автор історичних романів"));
        dbHelpers.addData(new DateDb(387,"Який жанр домінує у творчості І. Драча?","балада","поема","сонет","медитація"));
        dbHelpers.addData(new DateDb(388,"Сорочку мати вишила мені\n" +
                "\n" +
                "Червоними і чорними нитками.\nрядки з твору","«Два кольори»","«Балада про соняшник»","«Наша мова»","«Чари ночі»"));
        dbHelpers.addData(new DateDb(389,"Хтось ними плакав, мучився, болів,\n" +
                "\n" +
                "із них почав і ними ж і завершив.\n" +
                "\n" +
                "Людей мільярди, і мільярди слів,\n" +
                "\n" +
                "а ти їх маєш вимовити вперше!\nрядки з твору","«Страшні слова, коли вони мовчать»","«Наша мова»","«О слово рідне! Орле скутий!..» ","«Dе Ііbеrtatе»"));
        dbHelpers.addData(new DateDb(390,"Історико-філософським соціально-психологічним романом у віршах є твір","«Маруся Чурай»","«Моя автобіографія»","«Місто»","«Чорна рада»"));
        dbHelpers.addData(new DateDb(391,"В основу цього твору Ліна Костенко поклала відому чи не кожному українцеві, знану в багатьох країнах світу баладу «Ой не ходи, Грицю...»","«Маруся Чурай»","«Лебеді материнства»","«Страшні слова, коли вони мовчать»","«Блакитна Панна»"));

        // TODO Твори укр' письменників-емігрантів
        dbHelpers.addData(new DateDb(392,"Справжнє прізвище Івана Багряного","Лозов’ягін (Лозов’яга)","Фітільов","Підмогильний","Мирний"));
        dbHelpers.addData(new DateDb(393,"«Тигролови» Івана Багряного за жанром – це","пригодницький роман","історичний роман","урбаністичний роман","роман у новелах"));
        dbHelpers.addData(new DateDb(394,"Де відбуваються події, описані у творі? («Тигролови»)","Далекий Схід","Близький Схід","Європа","Америка"));
        dbHelpers.addData(new DateDb(395,"У якому рядку записані імена героїв твору? («Тигролови»)","Григорій, Наталка, Денис, Фійона","Степан, Денис, Рина, Наталка","Мокій, Уля, Галя, Маруся","Маруся, Василь, Іван Гонта, Залізняк"));
        dbHelpers.addData(new DateDb(396,"Військове звання Медвина («Тигролови»)","майор","капітан","генерал","полковник"));
        dbHelpers.addData(new DateDb(397,"Кому належить вислів: «Ліпше вмерти біжучи, аніж жити гниючи»?","Григорію Многогрішному","майору Медвину","Дем’яну Многогрішному","Денису Сірку"));
        dbHelpers.addData(new DateDb(398,"Від кого врятував Григорій Многогрішний Наталку?","від ведмедя","від тигра","від браконьєра","від майора НКВС Медвина"));
        dbHelpers.addData(new DateDb(399,"Кому належить вислів: «У сміливих завжди щастя є»?","Сірчисі","Медвину","Удегейцю Інокентію Петровичу","Наталці"));
        dbHelpers.addData(new DateDb(400,"Що таке панти","роги оленя","бажання людини виділитися, вихваляння себе","людина, гідна поваги","балетні туфлі"));
        dbHelpers.addData(new DateDb(401,"Доповніть вислів, сказаний Денисом Сірком: «Бог не без милості, козак – не без …","Щастя","Люльки","Куреня","Насолоди"));
        dbHelpers.addData(new DateDb(402,"Інша назва «Тигроловів»","Звіролови","Мисливці","Сірки","Іншої назви немає"));
        dbHelpers.addData(new DateDb(403,"Драконом у «Тигроловах» є","потяг","майор Медвин","Сибір","ведмедиця"));
        dbHelpers.addData(new DateDb(404,"Григорій Многогрішний мав професію","авіатора","машиніста","мисливця","сталевара"));
        dbHelpers.addData(new DateDb(405,"Тоталітарну систему в романі «Тигролови» уособлює","майор Медвин","Григорій Многогрішний","Денис Сірко","Фійона"));
        dbHelpers.addData(new DateDb(406,"Ким був Дем’ян Многогрішний","гетьманом","мисливцем","лектором","майором"));
        dbHelpers.addData(new DateDb(407,"Скільки років каторги присудили Григорію Многогрішному","25 років","10 років","довічно","40 років"));
        dbHelpers.addData(new DateDb(408,"Спогад поета про запорозьке козацтво, колишню славу рідного краю, возвеличення історичної пам’яті українського народу, розкриття найкращих рис вдачі козаків-українців; заклик до пробудження в українців почуття національної свідомості, психології переможця, віра в силу й безсмертя рідного народу є мотивом вірша","«Уривок з поеми»","«Пам’яті тридцяти»","«Іntermezzo»","«Всякому місту - звичай і права»"));
        dbHelpers.addData(new DateDb(409,"Не паралітик і не лірник Народ мій — в гураган подій Жбурне тобою ще, невірний!\nуривок з твору","«Уривок з поеми»","«Наша мова»","«Любіть Україну!»","«Блакитна Панна»"));
        dbHelpers.addData(new DateDb(410,"Образи-символи Мазепи, Орлика, Гонти використано в поезії","«Уривок з поеми»","«Я (Романтика)»","«Чорна рада»","«Енеїда»"));


        // TODO Псевдоніми авторів
        dbHelpers.addData(new DateDb(411,"Справжнє прізвище Іван Нечуй-Левицького","Левицький Іван Семенович","Василь Симоненко","Шевченко Тарас Григорович","Квітка Григорій Федорович"));
        dbHelpers.addData(new DateDb(412,"Справжнє прізвище Панаса Мирного","Рудченко","Тобілевич","Мирний","Губенко"));
        dbHelpers.addData(new DateDb(413,"Справжнє прізвище Івана Карпенко-Карого","Тобілевич","Рудченко","Кандиба","Багряний"));
        dbHelpers.addData(new DateDb(414,"Справжнє прізвище Лесі Українки","Косач","Очерет","Українка","Пчілка"));
        dbHelpers.addData(new DateDb(415,"Справжнє прізвище Олександра Олеся","Кандиба","Рудченко","Самійленко","Садовський"));
        dbHelpers.addData(new DateDb(416,"Справжнє прізвище Миколи Хвильового","Фітільов","Тобілевич","Садовський","Лозов’ягін (Лозов’яга)"));
        dbHelpers.addData(new DateDb(417,"Справжнє прізвище Остапа Вишні","Губенко","Фітільов","Рудченко","Мирний"));
        dbHelpers.addData(new DateDb(418,"Справжнє прізвище Івана Багряного","Лозов’ягін (Лозов’яга)","Фітільов","Губенко","Хвильовий"));
        dbHelpers.addData(new DateDb(419,"Псвевдонім Левицького Івана Семеновича","Іван Нечуй-Левицький","Григорій Квітка-Основ'яненко","Іван Карпенко-Карий","Панас Саксаганський"));
        dbHelpers.addData(new DateDb(420,"Псвевдонім Рудченко Панаса Яковича","Панас Мирний","Микола Садовський","Олександр Олесь","Фітільов Микола"));
        dbHelpers.addData(new DateDb(421,"Псвевдонім Тобілевича Івана Карповича","Іван Карпенко-Карий","Іван Нечуй-Левицький","Микола Садовський","Григорій Квітка-Основ'яненко"));
        dbHelpers.addData(new DateDb(422,"Псвевдонім Косач Лариси Петрівни","Леся Українка","Олена Пчілка","Косач-Квітка Лариса Петрівна","Марко Вовчок"));
        dbHelpers.addData(new DateDb(423,"Псвевдонім Кандиби Олександра Івановича","Олександр Олесь","Григорій Косинка","Іван Багряний","Тобілевич Панас"));
        dbHelpers.addData(new DateDb(424,"Псвевдонім Фітільова Миколи Григоровича","Микола Хвильовий","Микола Садовський","Іван Багряний","Григорій Квітка"));
        dbHelpers.addData(new DateDb(425,"Псвевдонім Губенка Павла Михайловича","Остап Вишня","Олександр Олесь","Панас Саксаганський","Микола Фітільов"));
        dbHelpers.addData(new DateDb(426,"Псвевдонім Лозов’ягіна (Лозов’яги) Івана Павловича","Іван Багряний","Микола Фітільов","Григорій Косинка","Панас Мирний"));

        // TODO Біографія письменників
        dbHelpers.addData(new DateDb(427,"У літературі Григорія Сковороду прийнято називати:","українським Сократом","українським Прометеєм","українським Платоном","українським Арістотелем"));
        dbHelpers.addData(new DateDb(428,"Вже  у 16 років вступив до Києво-Могилянської академії – першого вищого навчального закладу в Україні. Вивчав латинську, грецьку, церковнослов’янську, польську, німецьку та інші мови. Грав на сопілці, флейті, скрипці, гуслях, лірі, бандурі","Григорій Сковорода","Тарас Шевченко","Іван Франко","Василь Стефаник"));
        dbHelpers.addData(new DateDb(429,"Народився у Полтаві, в сім’ї канцеляриста. Закінчив Полтавську духовну семінарію та працював канцеляристом і домашнім учителем у сільських поміщицьких родинах. Служив у Сіверському карабінерському полку, брав участь у російсько-турецькій війні, був учасником облоги Ізмаїлу","Іван Котляревський","Григорій Сковорода","Олександр Олесь","Володимир Сосюра"));
        dbHelpers.addData(new DateDb(430,"Де знаходиться могила великого Кобзаря?","В Черкаській області","У Львівській області","У Київській області","У Житомирській області"));
        dbHelpers.addData(new DateDb(431,"На якій український банкноті зображений Тарас Шевченко?","100 гривень","200 гривень","50 гривень","500 гривень"));
        dbHelpers.addData(new DateDb(432,"«Кулішівка» — це:","правопис, котрий винайшов П. Куліш","земля, де було народжено письменника","збірка Пантелеймона Куліша, котру було опубліковано у 1857 р","назва журналу, де було опубліковано твори за авторством Пантелеймона Куліша"));
        dbHelpers.addData(new DateDb(433,"Укажіть, у якому громадсько-політичному об’єднанні працювали Т. Шевченко і П. Куліш","у Кирило-Мефодіївському братстві","у Петербурзькій академії мистецтв","у товаристві любителів рідного слова","у Києво-Могилянській академії"));
        dbHelpers.addData(new DateDb(434,"Яка тема є центральною у творчості Івана Нечуя-Левицького?","тема народної долі, показ краси душі простих людей","показ життя українського інтелігента XIX століття","тема стихійних повстань простого люду проти засилля панів","тема національно-визвольної боротьби українського народу проти кріпацтва"));
        dbHelpers.addData(new DateDb(435,"Яка тема є для Панаса Мирного найулюбленішою?","життя і праця, мрії і сподівання селянства","історичне минуле українського народу","визвольна боротьба українського народу за незалежність","чиновницьке життя"));
        dbHelpers.addData(new DateDb(436,"Рідною сестрою Карпенка-Карого була акторка театру «корифеїв»","Марія Садовська -Барілотті","Ганна Затиркевич-Карпинська","Соломія Крушельницька","Марія Заньковецька"));
        dbHelpers.addData(new DateDb(437,"Йому належить ініціатива ширшого вживання в Галичині назви “українці” замість “русини” — так традиційно називали себе корінні галичани. В “Одвертому листі до галицької української молодежі” (1905) він писав: “Ми мусимо навчитися чути себе українцями — не галицькими, не буковинськими, а українцями без соціальних кордонів…”","Іван Франко","Олександр Олесь","Володимир Сосюра","Остап Вишня"));
        dbHelpers.addData(new DateDb(438,"Де знаходиться могила Михайла Коцюбинського?","на Болдиній горі в Чернігові","на Лочаківському кладовищі у Львові","на Байковому кладовищі в Києві","на Ваганьківському кладовищі в Москві"));
        dbHelpers.addData(new DateDb(439,"Майстром якого літературного жанру вважається Василь Стефаник?","соціально-психологічної новели","соціально-психологічної драми","соціально-психологічної повісті","соціально-психологічного роману"));
        dbHelpers.addData(new DateDb(440,"Кого М. Старицікий назвав «пишною трояндою в саду української літератури»?","Ольгу Кобилянську","Марка Вовчка","Лесю Українку","Олену Пчілку"));
        dbHelpers.addData(new DateDb(441,"Якою мовою були написані перші твори Ольги Кобилянської?","німецькою","французькою","англійською","російською"));
        dbHelpers.addData(new DateDb(442,"Яку освіту здобула Леся Українка?","домашню","гімназійну","університетську","загальноосвітню"));
        dbHelpers.addData(new DateDb(443,"Де зустріла свої останні дні Леся Українка?","в Грузії","в Єгипті","в Україні","в Росії"));
        dbHelpers.addData(new DateDb(444,"Надзвичайно різностороння людина. Водночас театрознавець і актор, літературознавець і поет, перекладач і редактор. Та, перш за все, він — щирий патріот своєї України,який народився на Катеринославщині","Микола Вороний","Максим Рильський","Олександр Довженко","Микола Куліш"));
        dbHelpers.addData(new DateDb(445,"Олесем його називала дружина. У результаті поет почав друкувати інтимну лірику (а згодом й інші твори) саме під таким псевдонімом","Олександр Кандиба","Тарас Шевченко","Андрій Малишко","Григорій Сковорода"));
        dbHelpers.addData(new DateDb(446,"Укажіть назву населеного пункту, де народився Павло Тичина","с. Піски на Чернігівщині","с. Мотронівка на Чернігівщині","с. Крути на Чернігівщині","с. Седнів на Чернігівщині"));
        dbHelpers.addData(new DateDb(447,"Укажіть, у якому віці М. Рильський випустив свою першу поетичну збірку «На білих островах»","у 15 років","у 17 років","у 19 років","у 23 роки"));
        dbHelpers.addData(new DateDb(448,"Микола Хвильовий був організатором та ідеологом літературного об’єднання","«ВАПЛІТЕ» ","«Молодняк»","«Луг»","«Гарт»"));
        dbHelpers.addData(new DateDb(449,"Яким псевдонімом Юрій Яновський підписав свою першу поезію?","Георгій Ней","Юрій Майоров","Георгій Яновський","Юрій Юрченко"));
        dbHelpers.addData(new DateDb(450,"Дитинство поета минає на Донбасі в с. Третя Рота. З одинадцяти років хлопчик починає працювати. Спочатку в бондарному цеху содового заводу, потім телефоністом, чорноробом.","Володимир Сосюра","Іван Франко","Василь Стус","Дмитро Павличко"));
        dbHelpers.addData(new DateDb(451,"Валер'ян Підмогильний почав друкуватися ще зі школи під псевдонімом","Лорд Лістер","Зігмунд","Фрейд","Сартр"));
        dbHelpers.addData(new DateDb(452,"Остап Вишня ввів у літературу жанр","усмішки","фейлетону","сатиричного оповідання","анекдоту"));
        dbHelpers.addData(new DateDb(453,"Укажіть назву першого сатиричного твору Остапа Вишні","«Демократичні реформи Денікіна»","«Мисливські усмішки»","«Зенітка»","«Моя автобіографія»"));
        dbHelpers.addData(new DateDb(454,"Яку організацію очолював М. Куліш у харківський період свого життя?","ВАПЛІТЕ","Молодняк","Плуг","ВУСПП"));
        dbHelpers.addData(new DateDb(455,"Богдан-Ігор Антонич народився на території","Лемківщині","Поділлі","Волині","Буковині"));
        dbHelpers.addData(new DateDb(456,"Слова Чарлі Чапліна : «Слов’янство поки що дало світові в кінематографії одного великого митця, мислителя і поета — »?","Олександра Довженка","Тараса Шевченка","Івана Багряного","Василя Стуса"));
        dbHelpers.addData(new DateDb(457,"Як підписував О. Довженко свої перші карикатури?","Сашко","Десняк","Довжик","Олександр"));
        dbHelpers.addData(new DateDb(458,"Укажіть найхарактернішу ознаку поезії Андрія Малишка","кордоцентризм","егоцентризм","переважність історичних мотивів","постійне звернення до античної тематики"));
        dbHelpers.addData(new DateDb(459,"Яка тема є однією з провідних у творчості Андрія Малишка?","України","збереження рідної мови","кохання","охорони природного середовища"));
        dbHelpers.addData(new DateDb(460,"Критика сталінського режиму в казковій, фантастичній формі є домінантами творчості","Василя Симоненка","Тараса Шевченка","Івана Франка","Пантелеймона Куліша"));
        dbHelpers.addData(new DateDb(461,"До якого покоління українських митців належить В. Симоненко?","«Шістдесятники»","«Вісімдесятники»","«Розстріляне відродження»","«П’ятдесятники»"));
        dbHelpers.addData(new DateDb(462,"Яке прізвище (батькове) мав Олесь Гончар в ранньому дитинстві?","Біліченко","Білик","Гончаренко","Гончар"));
        dbHelpers.addData(new DateDb(463,"Де виховувався Олесь Гончар після смерті матері?","у бабусі та дідуся","в інтернаті","у чужих людей","у сім ‘ї батька та мачухи"));
        dbHelpers.addData(new DateDb(464,"Григір Тютюнник відомий в українській літературі як","майстер психологічної новели","поет-пісняр","байкар","автор історичних романів"));
        dbHelpers.addData(new DateDb(465,"Для творчості В. Стуса характерні всі перелічені мотиви, крім","християнського смирення","мужнього старждання, нерозкаяності","осмислення уроків української історії, трагічних помилок предків","утвердження людського «Я», бунту особистості проти системи"));
        dbHelpers.addData(new DateDb(466,"Іван Драч належить до","«шістдесятників»","«Розстріляного відродження»","Нью-Йоркської групи","МУРу"));
        dbHelpers.addData(new DateDb(467,"Образи соняшника й сонця, що символізують поета й поезію, створив","Іван Драч","Василь Стус","Павло Тичина","Василь Симоненко"));
        dbHelpers.addData(new DateDb(468,"М. Рильський дав таку характеристику поету .....:\n" +
                "«Поет має гостре око, він уміє не тільки дивитись, а й бачити»?","Дмитрові Павличку","Тарасу Шевченку","Івану Франку","Григорію Сковороді"));
        dbHelpers.addData(new DateDb(469,"Перша поетична збірка Ліни Костенко має назву","«Проміння землі»","«Над берегами вічної ріки»","«Вітрила»","«Зоряний інтеграл»"));
        dbHelpers.addData(new DateDb(470,"Укажіть найголовнішу тему поезії Є. Маланюка","доля України, її прадавнє минуле і драматичне сучасне","кохання","реалії емігрантського життя","краса рідної землі"));

        // TODO Де відбуваються події
        dbHelpers.addData(new DateDb(471,"Місце розгортання подій у творі «Ой Морозе, Морозенку»","Савур-могила","Жовті Води","Село під Полтавою","Тополівка"));
        dbHelpers.addData(new DateDb(472,"Місце розгортання подій у творі «Чи не той то Хміль»","Жовті Води","Чорне море","Пустеля","р. Каяла"));
        dbHelpers.addData(new DateDb(473,"Місце розгортання подій у творі «Дума про Марусю Богуславку»","Туреччина","Єгипет","Ізраїль","Україна"));
        dbHelpers.addData(new DateDb(474,"Місце розгортання подій у творі «Наталка Полтавка»","Село під Полтавою","Буковина","Ужгород","Семигори"));
        dbHelpers.addData(new DateDb(475,"Місце розгортання подій у творі «Хіба ревуть воли, як ясла повні» П. Мирний","Піски","Семигори","Тополівка","Ніжин"));
        dbHelpers.addData(new DateDb(476,"Місце розгортання подій у творі «Мойсей»","Близький Схід","Далекий Схід","Європа","Австралія"));
        dbHelpers.addData(new DateDb(477,"Місце розгортання подій у творі «Intermezzo»","Кононівка","Сосниця","Тополівка","Чигирин"));
        dbHelpers.addData(new DateDb(478,"Місце розгортання подій у творі «Пам'яті тридцяти» П. Тичина ","Аскольдова могила","Чернеча гора","Канів","Путивль"));
        dbHelpers.addData(new DateDb(479,"Місце розгортання подій у творі «Україна в огні»","Тополівка","Зелений Клин","Богуслав","Рангун"));
        dbHelpers.addData(new DateDb(480,"Місце розгортання подій у творі «Мина Мазайло»","Харків","Київ","Львів","Одеса"));
        dbHelpers.addData(new DateDb(481,"Місце розгортання подій у творі «Різдво» ","Лемківське містечко Дуклі","Ніжин","Зелений Клин","Далекий Схід"));
        dbHelpers.addData(new DateDb(482,"Місце розгортання подій у творі «Сом»","річка Оскіл","річка Десна","річка Осерет","річка Серет"));
        dbHelpers.addData(new DateDb(483,"Місце розгортання подій у творі «Маруся Чурай»","Київ, Полтава","Буковина, Ужгород","Київ, Львів","Полтава, Харків"));
        dbHelpers.addData(new DateDb(484,"Місце розгортання подій у творі «Лісова пісня»","Волинь","Вінниця","Львів","Луцьк"));
        dbHelpers.addData(new DateDb(485,"Місце розгортання подій у творі «Місто»","Київ","Харків","Львів","Дніпропетровськ"));
        dbHelpers.addData(new DateDb(486,"Місце розгортання подій у творі «Чорна рада»","Київ, Ніжин, хутір Хмарище, Романівський Кут","Луцьк, Волинь, хутір Хмарище, Романівський Кут","Запоріжжя, Харків, Полтава","Чигирин, Умань, Лебедин, Лисянка, Вільшана"));


        // TODO Цитати про авторів
        dbHelpers.addData(new DateDb(487,"«Він був кріпаком і став велетнем у царстві людської культурі» сказав Франко про","Шевченка","Коцюбинського","Тичину","Сосюру"));
        dbHelpers.addData(new DateDb(488,"«... – перворядна зірка в нашому письменстві, великий знавець української мові, а притім добрий знавець язиків і літератур європейських народів» сказав Франко про","Куліша","Мирного","Олеся","Хвильового"));
        dbHelpers.addData(new DateDb(489,"\"Пишна троянда в саду української літератури\" сказав Старицький про","О. Кобилянську","Лесю Українку","О. Пчілку","М. Вілінську"));
        dbHelpers.addData(new DateDb(490,"«Жодна література світу не має такого правдивого, дотепного, людяного, сонячного, хоч дещо і захмареного тугою за кращим життям твору про селянство» сказав М.Рильський про першу соціально-побутову повість","Івана-Нечуй Левицького","Івана Карпенка-Карого","Максима Рильського","Остапа Вишню"));
        dbHelpers.addData(new DateDb(491,"«.... – справжній мисливець і при тому поет полювання»","Остап Вишня","Андрій Малишко","Микола Куліш","Василь Голобородько"));
        dbHelpers.addData(new DateDb(492,"« - це обдарована особа, неповторна і трагічна, навіть трагікомічна, народник без народу, елітист без еліти, літератор без літератури, політик без політичного діяння» сказав Юрій Шерех про","Куліша","Драча","Стуса","Павличка"));
        dbHelpers.addData(new DateDb(493,"«…У важкі часи безправ’я і темряви він був для Західної України і університетом, і енциклопедією, і академією наук, і народним, не затвердженим ніякою монаршою ласкою міністром культури та освіти…» сказав Тичина про","Івана Франка","Тараса Щевченка","Панаса Мирного","Івана Багряного"));
        dbHelpers.addData(new DateDb(494,"«....! Це звучить узагальнююче, як ім'я, в якому злились мільйони українок і українців, мільйони безвісних чесних борців за свободу, які в глухі часи жорстокого царизму вслід за російським пролетаріатом не побоялися устати проти гніту й рабства» ","Леся Українка","О. Пчілка","М. Вілінська","О. Кобилянська"));
        dbHelpers.addData(new DateDb(495,"Її твори відзначаються реалістичною правдою, глибоко захоплюючим способом зображення, силою почуття і мистецькою красою форм і мови","Ольга Кобилянська","Леся Українка","Ліна Костенко","Олена Пчілка"));
        dbHelpers.addData(new DateDb(496,"«Його проза – це синтез народності і гуманізму, воістину загальнолюдського масштабу інтереси, глибинність естетичного змісту, рівне мислення, вивершеність образів, найяскравіші грані майстерності, завдяки чому твори .... – це і духовний образ, і суть буття народу, його жива історія, великі гуманістичні уроки, мрія про будучину»","Михайла Коцюбинського","Івана Котляревського","Олександра Олеся","Юрія Яновського"));
        dbHelpers.addData(new DateDb(497,"«... уже в «Сонячних кларнетах» відкрив усі свої козирі, а потім не раз був примушений до гри слабої і безкозирної» сказав Зеров про" ,"Тичину","Гончара","Шевченка","Франка"));
        dbHelpers.addData(new DateDb(498,"«... досить витончений і складний поет… І живе він зі своїм часом, напружено і уважно в навколишнє життя вдивляється, уміє помічати в його глибині струю вічно людського, близького всім часам і народам» сказав Зеров про ","Рильського","Голобородька","Стуса","Маланюка"));
        dbHelpers.addData(new DateDb(499,"«Коли б хтось із читачів оцих моїх спогадів та запитав мене, кого з молодих українських письменників двадцятих—тридцятих років я вважаю найбільш інтелектуально заглибленим, душевно тонким або, по-простому кажучи, найбільш інтелігентним, то я б ні на хвилину не задумався і відказав: —  ...» (Ю. Смолич)","Валер’ян Підмогильний","Михайло Коцюбинський","Тарас Шевченко","Іван Котляревський"));
        dbHelpers.addData(new DateDb(500,"«Розум він мав вольтерівської гостроти, викривач він був незрівнянний, та все ж визначальним, мені здається, в його вдачі було саме це: ніжність, душевність, поетичність. Ніякі найстуденіші вітри тяжких часів не могли остудити в його душі жар любові — невгасимої любові до народу, до Вітчизни, до краси життя й мистецтва.» сказав О. Гончар про","Остапа Вишню","Богдана-Ігоря Антонича","Івана Карпенка-Карого","Григорія Сковороду"));


        // TODO Присвяти
        dbHelpers.addData(new DateDb(501,"«Катерина» Т. Шевченка присвячена","В.А. Жуковському","Карлу Брюлову","Евгенію Гребенку","Якову де Бальмену"));
        dbHelpers.addData(new DateDb(502,"«Кавказ» Т. Шевченка присвячений","Якову де Бальмену","Наталі Кобринській","В.А. Жуковському","батькові"));
        dbHelpers.addData(new DateDb(503,"«Intermezzo» М. Коцюбинського присвячений","кононівським полям","любові всевишній","Якову де Бальмену","Т. Шевченку"));
        dbHelpers.addData(new DateDb(504,"«Я (Романтика)» М. Хвильового присвячена","цвiтовi яблунi","сізіфовій праці","любові всевишній","кононівським полям"));
        dbHelpers.addData(new DateDb(505,"«Три зозулі з поклоном» Тютюнника присвячені","любові всевишній","сестрі","усім жінкам","цвiтовi яблунi"));

        // TODO Як називають письменників
        dbHelpers.addData(new DateDb(506,"«український Сократ», «український Горацій», «український Езоп»","Григорій Сковорода","Тарас Шевченко","Іван Франко","Іван Котляревський"));
        dbHelpers.addData(new DateDb(507,"Засновник нової української прози","Григорій Квітка-Основ’яненко","Іван Нечуй-Левицький","Михайло Коцюбинський","Григорій Сковорода"));
        dbHelpers.addData(new DateDb(508,"Великий Кобзар, Батько української нації","Шевченко","Франко","Сосюра","Малишко"));
        dbHelpers.addData(new DateDb(509,"\"Великий артист зору\", \"Всеобіймаюче око України\"","Іван Нечуй-Левицький","Максим Рильський","Павло Тичина","Богдан-Ігор Антонич"));
        dbHelpers.addData(new DateDb(510,"«Корифей української прози», \"Перший симфоніст української прози\"","Панас Мирний","Остап Вишня","Юрій Яновський","Валер'ян Підмогильний"));
        dbHelpers.addData(new DateDb(511,"\"Дочка Прометея\"","Леся Українка","Ольга Кобилянська","Олена Пчілка","Ліна Костенко"));
        dbHelpers.addData(new DateDb(512,"\"Гірська орлиця\"","Ольга Кобилянська","Олена Пчілка","Леся Українка","Ліна Костенко"));
        dbHelpers.addData(new DateDb(513,"\"Великий сонцепоклонник\"","Михайло Коцюбинський","Дмитро Павличко","Іван Драч","Олександр Довженко"));
        dbHelpers.addData(new DateDb(514,"\"Бард національного відродження\"","Олександр Олесь","Остап Вишня","Григір Тютюнник","Іван Франко"));
        dbHelpers.addData(new DateDb(515,"\"Основоположник української прози ХХ ст.\"","М. Хвильовий","М. Куліш","В. Підмогильний","Ю. Яновський"));
        dbHelpers.addData(new DateDb(516,"\"Поет залізних строф\"","Є. Маланюк","П. Тичина","Г. Сковорода","І. Котляревський"));
        dbHelpers.addData(new DateDb(517,"«Король українського тиражу»","Остап Вишня","Микола Вороний","Василь Голобородько","Олесь Гончар"));
        dbHelpers.addData(new DateDb(518,"\"Солов'їне серце України\"","А. Малишко","М. Рильський","В. Стефаник","І. Багряний"));
        dbHelpers.addData(new DateDb(519,"«Сонячний поет»","Іван Драч","Євген Маланюк","Михайло Коцюбинський","Іван Карпенко-Карий"));
        dbHelpers.addData(new DateDb(520,"\"Витязь молодої української поезії\"","В. Симоненко","П. Куліш","М. Куліш","О. Довженко"));
        dbHelpers.addData(new DateDb(521,"\"Різьбяр власного духу\"","Василь Стус","Дмитро Павличко","Андрій Малишко","Юрій Яновський"));
        dbHelpers.addData(new DateDb(522,"\"Один із найвидатніших наших новелістів\" за словами В. Шевчука ","Григір Тютюнник","Тарас Шевченко","Іван Багряний","Володимир Сосюра"));
        dbHelpers.addData(new DateDb(523,"\"Дівчина з легенди\", \"Українська Сапфо\"","Маруся Чурай","Ліна Костенко","Леся Українка","Ольга Кобилянська"));
        dbHelpers.addData(new DateDb(524,"Сонячний кларнетист","Павло Тичина","Остап Вишня","Панас Мирний","Олеся Гончар"));
        dbHelpers.addData(new DateDb(525,"«Той, у кого ім’я викрадено»","Василь Голобородько","Дмитро Павличко","Василь Симоненко","Іван Драч"));
        dbHelpers.addData(new DateDb(526,"Зачинатель нової української літератури","Іван Котляревський","Григорій Сковорода","Іван Карпенко-Карий","Іван Нечуй-Левицький"));
        dbHelpers.addData(new DateDb(527,"Великий Каменяр","Іван Франко","Василь Стефаник","Максим Рильський","Микола Вороний"));
        dbHelpers.addData(new DateDb(528,"Зачинатель українського модернізму, Співець краси","Микола Вороний","Андрій Малишко","Василь Голобородько","Іван Франко"));
        dbHelpers.addData(new DateDb(529,"Український соловейко, співець донецького краю","Володимир Сосюра","Євген Маланюк","Богдан-Ігор Антонич","Пантелеймон Куліш"));
        dbHelpers.addData(new DateDb(530,"Один з основоположників національного кінематографа, класик світового кінематографа","Олександр Довженко","Микола Хвильовий","Олександр Олесь","Олесь Гончар"));


        // TODO Жанри творів
        dbHelpers.addData(new DateDb(531,"Жанр творів «Віють вітри, віють буйні», «Засвіт встали козаченьки»","усна народна пісня","історична пісня","повість","поема"));
        dbHelpers.addData(new DateDb(532,"Жанр творів \"Ой Морозе, Морозенку\", \"Чи не той то хміль\"","історична пісня","усна народна пісня","героїчна поема","дума"));
        dbHelpers.addData(new DateDb(533,"Жанр твору \"Маруся Богуславка\"","дума","історична пісня","літопис","ліричний вірш"));
        dbHelpers.addData(new DateDb(534,"Жанр твору «Повість минулих літ»","літопис","дума","історична пісня","ліричний вірш"));
        dbHelpers.addData(new DateDb(535,"Жанр твору «Слово про похід Ігорів»","героїчна поема","історична пісня","літопис","байка"));
        dbHelpers.addData(new DateDb(536,"Жанр твору «De libertate»","ліричний вірш","історична пісня","дума","повість"));
        dbHelpers.addData(new DateDb(537,"Жанр твору «Бджола та Шершень»","байка","повість","дума","роман"));
        dbHelpers.addData(new DateDb(538,"Жанр твору «Енеїда»","бурлескно-травестійна поема","сатирична поема","соціально-побутова поема","історичний роман"));
        dbHelpers.addData(new DateDb(539,"Жанр твору «Наталка Полтавка»","соціально-побутова драма","бурлескно-травестійна поема","соціально-психологічна драма","філософська поема"));
        dbHelpers.addData(new DateDb(540,"Жанр твору «Катерина»","соціально-побутова поема","соціально-психологічна поема","трагікомедія","кіноповість"));
        dbHelpers.addData(new DateDb(541,"Жанр твору «Кавказ»","сатирична поема","філософська поема","послання","повість"));
        dbHelpers.addData(new DateDb(542,"Жанр твору «Сон» («У всякого своя доля»)","сатирична поема","філософська поема","музична новела","історична повість"));
        dbHelpers.addData(new DateDb(543,"Жанр твору «І мертвим, і живим…»","послання (громадянська + патріотична лірика)","сатирична поема","соціально-побутова поема","ліричний вірш"));
        dbHelpers.addData(new DateDb(544,"Жанр твору «Заповіт»","ліричний вірш (громадянска лірика)","сатирична поема","дума","романс"));
        dbHelpers.addData(new DateDb(545,"Жанр твору «Чорна рада»","історичний роман","пригодницький роман","роман у віршах","соціально-побутова драма"));
        dbHelpers.addData(new DateDb(546,"Жанр твору «Кайдашева сім’я»","повість","роман","поема","байка"));
        dbHelpers.addData(new DateDb(547,"Жанр твору «Хіба ревуть воли, як ясла повні?»","соціально-психологічний роман","історичний роман","автобіографічний роман","пригодницький роман"));
        dbHelpers.addData(new DateDb(548,"Жанр твору «Мартин Боруля»","трагікомедія","модерна балада","байка","усмішка"));
        dbHelpers.addData(new DateDb(549,"Жанр твору «Захар Беркут»","історична повість","ліричний вірш","соціально-побутова драма","історичний роман"));
        dbHelpers.addData(new DateDb(550,"Жанр твору «Чого являєшся мені у сні?»","ліричний вірш (інтимна лірика)","послання","філософська поема","новела"));
        dbHelpers.addData(new DateDb(551,"Жанр твору «Мойсей»","філософська поема","роман у віршах","вірш-реквіємa","урбаністичний роман"));
        dbHelpers.addData(new DateDb(552,"Жанр твору «Тіні забутих предків»","повість","поема","новела","роман"));
        dbHelpers.addData(new DateDb(553,"Жанр твору «Intermezzo»","новела","дума","повість","вірш"));
        dbHelpers.addData(new DateDb(554,"Жанр твору «Камінний хрест»","психологічна новела","сатирична поема","філософська поема","музична новела"));
        dbHelpers.addData(new DateDb(555,"Жанр твору «Valse mélancolique»","музична новела","психологічна новела","роман у віршах","історична пісня"));
        dbHelpers.addData(new DateDb(556,"Жанр твору «Соntra spem spero!»","ліричний вірш (філософська + особиста лірика)","історична пісня","усна народна пісня","філософська поема"));
        dbHelpers.addData(new DateDb(557,"Жанр твору «Лісова пісня»","драма-феєрія","трагікомедія","модерна балада","кіноповість"));
        dbHelpers.addData(new DateDb(558,"Жанр твору «Блакитна Панна»","ліричний вірш (пейзажна лірика)","ліричний вірш (філософська лірика)","ліричний вірш (громадянська лірика)","романс"));
        dbHelpers.addData(new DateDb(559,"Жанр твору «Чари ночі»","романс (інтимна лірика)","ліричний вірш (пейзажна лірика)","вірш-реквіємa","історична пісня"));
        dbHelpers.addData(new DateDb(560,"Жанр твору «О слово рідне! Орле скутий!..»","ліричний вірш (патріотична лірика)","ліричний вірш (пейзажна лірика)","новела","байка"));
        dbHelpers.addData(new DateDb(561,"Жанр твору «О, панно Інно...»","ліричний вірш (інтимна лірика)","ліричний вірш (громадянська лірика)","усмішка","байка"));
        dbHelpers.addData(new DateDb(562,"Жанр твору «Пам’яті тридцяти»","вірш-реквіємa","новела","повість","поема"));
        dbHelpers.addData(new DateDb(563,"Жанр твору «Ви знаєте, як липа шелестить…»","ліричний вірш (інтимна + пейзажна лірика)","філософська поема","сатирична комедія","послання"));
        dbHelpers.addData(new DateDb(564,"Жанр твору «У теплі дні збирання винограду…»","сонет","романс","ліричний вірш","поема"));
        dbHelpers.addData(new DateDb(565,"Жанр твору «Я (Романтика)»","новела","роман у віршах","історичний роман","повість"));
        dbHelpers.addData(new DateDb(566,"Жанр твору «Майстер корабля»","автобіографічний роман","новела","поема","пригодницький роман"));
        dbHelpers.addData(new DateDb(567,"Жанр твору «Любіть Україну!»","ліричний вірш (патріотична лірика)","історична пісня","вірш-медитація","сонет"));
        dbHelpers.addData(new DateDb(568,"Жанр твору «Місто»","урбаністичний роман","пригодницький роман","історичний роман","соціально-побутова новела"));
        dbHelpers.addData(new DateDb(569,"Жанр твору «Моя автобіографія»","усмішка","байка","новела","сонет"));
        dbHelpers.addData(new DateDb(570,"Жанр твору «Сом»","усмішка","сонет","поема","сатирична новела"));
        dbHelpers.addData(new DateDb(571,"Жанр твору «Мина Мазайло»","сатирична комедія","усмішка","соціально-побутова новела","трагікомедія"));
        dbHelpers.addData(new DateDb(572,"Жанр твору «Різдво»","ліричний вірш (філософська лірика)","ліричний вірш (патріотична лірика)","ліричний вірш (громадянська лірика)","народна пісня"));
        dbHelpers.addData(new DateDb(573,"Жанр твору «Зачарована Десна»","кіноповість","трагікомедія","романс","сонет"));
        dbHelpers.addData(new DateDb(574,"Жанр твору «Пісня про рушник»","ліричний вірш (пісня)","новела","поема","вірш-реквієма"));
        dbHelpers.addData(new DateDb(575,"Жанр твору «Ти знаєш, що ти - людина...»","ліричний вірш","сонет","історична пісня","повість"));
        dbHelpers.addData(new DateDb(576,"Жанр твору «Задивляюсь у твої зіниці»","ліричний вірш (патріотична лірика)","психологічна новела","усмішка","романс"));
        dbHelpers.addData(new DateDb(577,"Жанр твору «Лебеді материнства»","ліричний вірш (колискова пісня)","ліричний вірш (патріотична лірика)","філософська поема","ліричний вірш(громадянська лірика)"));
        dbHelpers.addData(new DateDb(578,"Жанр твору «Наша мова»"," патріотичний і філософський вірш","історична пісня","усмішка","кіноповість"));
        dbHelpers.addData(new DateDb(579,"Жанр твору «Модри камінь»","психологічна новела","соціально-побутова поема","ліричний вірш","комедія"));
        dbHelpers.addData(new DateDb(580,"Жанр твору «Три зозулі з поклоном»","новела","поема","роман","сонет"));
        dbHelpers.addData(new DateDb(581,"Жанр твору «Господи, гніву пречистого...»","вірш-медитація (молитва)","послання","сонет","вірш-реквіємa"));
        dbHelpers.addData(new DateDb(582,"Жанр твору «Балада про соняшник»","модерна балада","усмішка","байка","ліричний вірш"));
        dbHelpers.addData(new DateDb(583,"Жанр твору «Два кольори»","ліричний вірш (пісня)","послання","поема","сонет"));
        dbHelpers.addData(new DateDb(584,"Жанр твору «Страшні слова, коли вони мовчать»","ліричний вірш (філософська + громадянська лірика)","поема","новела","романс"));
        dbHelpers.addData(new DateDb(585,"Жанр твору «Маруся Чурай»","роман у віршах","соціально-побутова новела","психологічна поема","автобіографічний роман"));
        dbHelpers.addData(new DateDb(586,"Жанр твору «Тигролови»","пригодницький роман","урбаністичний роман","роман у віршах","історичний роман"));
        dbHelpers.addData(new DateDb(587,"Жанр твору «Уривок з поеми»","вірш(громадянська лірика)","послання","поема","сонет"));

        // TODO Герої Творів
        dbHelpers.addData(new DateDb(588,"Кий, Щек, Хорив і Либідь, княгиня Ольга й князь Святослав - головні герої твору","«Повість минулих літ»","«Я (Романтика)»","«Чорна рада»","«Хіба ревуть воли, як ясла повні?»"));
        dbHelpers.addData(new DateDb(589,"Князі Ігор, Святослав і Всеволод; Ярославна (дружина Ігоря); половці Овлур, Гзак і Кончак - головні герої твору","«Слово про похід Ігорів»","«Повість минулих літ»","«Хіба ревуть воли, як ясла повні?»","«Тигролови»"));
        dbHelpers.addData(new DateDb(590,"Зевс, Юнона, Венера, Еол, Нептун - персонажі з твору","«Енеїда»","«Тіні забутих предків»","«Камінний хрест»","«Майстер корабля»"));
        dbHelpers.addData(new DateDb(591,"Горпина Терпелиха, возний Тетерваковський, виборний Макогоненко, бурлака Микола - персонажі з твору","«Наталка-Полтавка»","«Тіні забутих предків»","«Катерина»","«Кайдашева сім'я»"));
        dbHelpers.addData(new DateDb(592,"Яким Сомко, Павло Тетеря, Іван Брюховецький, Кирило Тур - персонажі з твору","«Чорна рада»","«Захар Беркут»","«Я (Романтика)»","«Три зозулі з поклоном»"));
        dbHelpers.addData(new DateDb(593,"Омелько, Маруся, Карпо, Лаврін,Мотря, Мелашка - головні герої твору","«Кайдашева сім'я»","«Камінний хрест»","«Наталка-Полтавка»","«Мина Мазайло»"));
        dbHelpers.addData(new DateDb(594,"Чіпка Варениченко, Максим Ґудзь, Явдоха, Грицько Чупруненко, Христя - головні герої твору","«Хіба ревуть воли, як ясла повні?»","«Маруся Чурай»","«Тигролови»","«Зачарована Десна»"));
        dbHelpers.addData(new DateDb(595,"Іван Вареник, баба Оришка, Василь Порох, Лушня, Пацюк - другорядні персонажі з твору","«Хіба ревуть воли, як ясла повні?»","«Моя автобіографія»","«Лісова пісня»","«Захар Беркут»"));
        dbHelpers.addData(new DateDb(596,"Мартин, Палажка, Степан, Гервасій Гуляницький, Микола, Націєвський - головні герої твору","«Мартин Боруля»","«Мина Мазайло»","«Три зозулі з поклоном»","«Мойсей»"));
        dbHelpers.addData(new DateDb(597,"Єгошуа, Єгова, Датан і Авірон - персонажі з твору","«Мойсей»","«Енеїда»","«Повість минулих літ»","«Чорна рада»"));
        dbHelpers.addData(new DateDb(598,"Марічка Гутенюк та її родина, Іван Палійчук та його родина; Палагна — дружина Івана Палійчука; Юра, сусід Палійчуків, мольфар; щезник, нявка, чугайстир - персонажі твору","«Тіні забутих предків»","«Захар Беркут»","«Тигролови»","«Маруся Чурай»"));
        dbHelpers.addData(new DateDb(599,"Іван Дідух, його дружина Катерина, їхні діти, кум Михайло - головні герої твору","«Камінний хрест»","«Сом»","«Лісова пісня»","«Valse mélancolique»"));
        dbHelpers.addData(new DateDb(600,"Царівна Мавка, Лукаш, дядько Лев, мати Лукаша, Килина, Лісовик, Перелесник, Русалка - персонажі твору","«Лісова пісня»","«Тіні забутих предків»","«Модри камінь»","«Зачарована Десна»"));
        dbHelpers.addData(new DateDb(601,"Степан Радченко, Надійка, Левко, Ганнуся та Нюся, Лука Гнідий, Тамара Василівна (Мусінька) - персонажі твору","«Місто»","«Тигролови»","«Мина Мазайло»","«Мартин Боруля»"));

    }

}
