package learn.zno.znostudy;

import android.content.Intent;
import android.os.Bundle;
import android.os.CountDownTimer;
import android.os.Handler;
import android.view.View;
import android.widget.Button;
import android.widget.ProgressBar;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;

import java.util.Random;

public class TrueOrFalse extends AppCompatActivity {

    private String questions[] = {
            "Місце розгортання подій у творі 'Місто' відбувається у Києві",
            "Місце розгортання подій у творі 'Мина Мазайло' відбувається у Львові",
            "Місце розгортання подій у творі 'Наталка Полтавка' відбувається під Полтавою",
            "Місце розгортання подій у творі 'Сом' відбувається на річці Десна",
            "Марко Вовчок це псевдонім Вілінської Марії Олександрівни",
            "Іван Багряний це псевдонім Губенка Павла Михайловича",
            "Григорій Квітка-Основ’яненко це псевдонім Квітки Григорія Федоровича",
            "'Катерина' Шевченка присвячена Григоровичу на пам’ять 22.04.1838",
            "'Кавказ' Шевченка присвячен іскрєннєму моєму Якову де Бальмену",
            "Корифеєм української прози називають Панаса Мирного",
            "Гірською орлицею називають Ліну Костенко",
            "Всеобіймаючим Оком України називають ван Нечуй-Левицького",
            "Сонячний поет - Іван Драч",
            "Епічною бурлескно-травестійною поемою є Енеїда",
            "Анхіз, Низ, Еол - це герої твору 'Чорна Рада'",
            "За формою «Заповіт» — монолог",
            "Тема «Чорна Рада»: зображення історичних подій у Ніжині 1663 р. — доби Руїни",
            "Тур, Шрам, Черевань - це герої твору 'Енеїда'",
            "Зав'язка твору ' Кайдашева сім'я ' - Груша всохла, і всі помирилися",
            "Історія гонитви селянина за дворянством і втрати надії на нього через прикрий недогляд покладена у твір Мина Мазайло",
            "Єгошуа, Датан, Авірон - герої твору 'Мойсей'",
            "Темою твору 'Камінний хрест' є еміграція галицького селянства на американський континент на межі XIX- XX ст.",
            "Сюжетна основа твору 'Пам'яті тридцяти' : поховання на Аскольдовій могилі українців-воїнів",
            "Протистояння добра і зла в душі героя («чекіста і людини»), його роздвоєність - тема твору 'Чорна Рада'",
            "«Як можна бути вільним, Евкріте, коли маєш тіло?» - епіграф до твору 'Місто' ",
            "Урбаністичним романом є 'Місто' Михайла Коцюбинського",
            "Усмішка 'Сом' складається з чотирьох частин",
            "Художнє відтворення проблеми українізації у 20-30-х роках XX ст.; сатиричне змалювання новітнього міщанства відображається в творі 'Мартин Боруля'",
            "Містечко Дуклі згадується у творі Остапа Вишні",
            "Жанр 'Зачарована Десна' - кіноповість",
            "«Ти знаєш, що ти — людина?», «Ти знаєш про це чи ні?» це риторичне запитання твору Андрія Малишко",
            "Новела 'Три зозулі з поклоном' має епіграф «Любові Всевишній присвячується»",
            "«В соняшника були руки і ноги» починається балада 'Пісня про рушник'",
            "Історико-філософським соціально-психологічним романом у віршах є 'Маруся Чурай' Ліни Костенко",
            "Пригодницьким романом є 'Тигролови' Лозов’ягіна (Лозов’яги) Івана Павловича",
            "Іван Багряний у творі 'Тигролови' порівнює поїзди з носорогами",
            "Косач - це справжнє прізвище автора твору Contra spem spero!",
            "«Ваша “Маруся” так мені про Вас розказала, що я Вас навиліт знаю», – написав Тарас Шевченко Іванові Нечую-Левицькому",
            "«Лемки у крисанях», які «принесли місяць круглий», є героями твору Богдана-Ігоря Антонича",
            "«Сміливі завжди мають щастя» – такою є ідея твору «Я (Романтика)»",
            "Уславлення Б. Хмельницького — народного ватажка, талановитого полководця, мудрого державного діяча це ідея твору «Засвіт встали козаченьки»",
            "Риторичне запитання «Чи ви знаєте, Що в нашій землі Та й день затепера?» взято з твору «Дума про Марусю Богуславку»",
            "Овлур, Гзак, Кончак - головні герої твору Слово про похід Ігорів",
            "У «Слова про похід Ігорів» автор наділяє порівнянням \"Буй-тур\" Ігоря",
            "У дійсності Ярославну звали Анною («Слово про похід Ігорів»)",
            "«Той, в кого совість як чистий кришталь» є ідеалом автора твору: «Чого являєшся мені у сні» Івана Франка",
            "Тема «сродної праці» присутня у творі Г. Сковороди",
            "4 сонця у «Слові про похід Ігорів» характеризують князів - учасників походу",
            "Вислів «Випускає він десять соколів на стадо лебедів» («Слово про похід Ігорів») означає затемнення сонця",
            "«Енеїда» за жанром – це соціально-побутова поема",
            "Учітесь, читайте, /І чужому научайтесь, / Й свого не цурайтесь - афоризм із твору «І мертвим, і живим, і ненарожденним…»",
            "Доба Руїни є історичним тлом твору «Я (Романтика)»",
            "Історичним джерелом, використаним П. Кулішем у сюжеті роману «Чорна рада», став Літопис Самовидця",
            "Реальна сім’я Мазурів була прототипом Кайдашевої",
            "Сюжетною основою для написання роману «Хіба ревуть воли, як ясла повні?» Панаса Мирного та Івана Білика став нарис Пропаща сила",
            "Прізвища Хрущ, Хрущов, Притика в романі «Хіба ревуть воли, як ясла повні?» мав Іван Вареник",
            "Роман «Хіба ревуть воли, як ясла повні?» при перевиданні в Україні 1903 р. мав назву «Пропаща сила»",
            "Зображення на широкому суспільному тлі життєпису злочинця Чіпки від його народження до ув’язнення на каторгу це тема твору «Кайдашева сім'я»",
            "За жанром твір І.Карпенка-Карого «Мартин Боруля» - комедія",
            "Страждання ліричного героя через нерозділене кохання - провідний мотив твору «Чого являєшся мені у сні?..»",
            "Автор твору «Мартин Боруля» є також автором «Чого являєшся мені у сні?..»",
            "У поемі «Мойсей» використано давньоримський сюжет",
            "Головна ідея поеми «Мойсей» — це заклик вірити у свій народ, позбутися рабської психології й будувати нове життя",
            "У повісті «Тіні забутих предків» змальовано Гуцульщину",
            "Символом розпачу від прощання з рідним краєм у новелі «Камінний хрест» є горб",
            "Темою новели «Камінний хрест» В. Стефаника є смерть селянина від тяжкої праці на землі",
            "За основу твору «Камінний хрест» автор узяв факт із життя Штефана Дідуха із с.Русова",
            "Камінний хрест, горб, прізвище Дідух – це у творі «Камінний хрест» образи-символи",
            "Музика — центральний образ твору «Valse Melancolique»",
            "У словах Лесі Українки «Я на гору круту крем’яную / Буду камінь важкий підіймать…» переосмислено образ Геракла",
            "Назва вірша «Contra spem spero!» перекладається з латини як через терни до зірок",
            "У новелі  «Я (Романтика)» главкомверх  чорного трибуналу вступає в конфлікт з власною совістю",
            "«Любіть Україну!» має форму послання",
            "Степан Радченко добирався із села до Києва потягом",
            "«Історичною здохлятиною» у творі «Місто» Вигорський називав \"Київ\"",
            "Характеристикою …очі, рот, стан — все чисто українське Мокій наділяє Рину («Мина Мазайло»)",
            "Факт народження Христа є темою твору «Різдво»",
            "«Ти знаєш, що ти — людина?», «Ти знаєш про це чи ні?» це риторичні оклики",
            "Григір Тютюнник відомий в українській літературі як майстер психологічної новели",
            "Військове звання Медвина - майор («Тигролови»)",
            "Панти - це роги оленя",
            "Григорій Многогрішний мав професію машиніста («Тигролови»)",
            "Образи-символи Мазепи, Орлика, Гонти використано в поезії «Уривок з поеми»",
            "«Він був кріпаком і став велетнем у царстві людської культурі» сказав Франко про Шевченка",
            "Зачинателем нової української літератури є Іван Нечуй-Левицький",
            "Одним з основоположників національного кінематографа, класик світового кінематографа є Олександр Довженко",
            "Жанр твору «Майстер корабля» - автобіографічний роман",
            "Омелько, Маруся, Карпо, Лаврін,Мотря, Мелашка - головні герої твору «Камінний хрест»",
            "Вперше селянин став літературним «серйозним» героєм під пером Г. Квітки-Основ’яненка",
            "Іван Нечуй-Левицький принципово не вживав літеру «Ї»",
            "«Добрий він, і душа щира, козацька, хоч удає з себе ледащицю і характерника», – сказано про Григорія Многогрішного",
            "Рефреном у вірші «Всякому місту – звичай і права» є рядки \"Я ж у полоні нав’язливих дум, Лише одне непокоїть мій ум…\"",
            "Ідея соборності України, пошуки суспільної сили, спроможної згуртувати й об’єднати націю, характерні для обох творів «Чорна рада» та «І мертвим, і живим, і ненарожденним…»",
            "Важку долю українських жінок в умовах Другої світової війни зображено у творі «Тигролови»",
            "Розділи «Свято в Чигирині», «Червоний бенкет», «Лебедин» є у творі, де діють герої Ярема Галайда, Іван Гонта",
            "Підзаголовок «Хроніка 1663 року» має твір Панаса Мирного",
            "«Запорожжя споконвіку було серцем українським, на Запорожжі воля ніколи не вмирала, давні звичаї ніколи не забувались», – пише автор твору «Хіба ревуть воли, як ясла повні?»",
            "Основна думка: 'Для кожної родини є хвилюючим моментом, коли її сини, чоловіки вирушають у військовий похід' характерна для твору «Засвіт встали козаченьки»",
            "Удовин син загинув від стріли у творі «Ой летіла стріла»",
            "Сон персонажа є елементом композиції твору «Слово про похід Ігорів»"

    };

    private String answers[] = {
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Брехня",
            "Брехня",
            "Правда",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Брехня",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Брехня",
            "Правда",
            "Правда",
            "Правда",
            "Брехня",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Правда",
            "Брехня",
            "Правда",
            "Брехня",
            "Брехня",
            "Правда",
            "Правда",
            "Правда"
    };


    private CountDownTimer countDownTimer;
    private long timemilliseconds = 41000;

    Random r;

    int i = 0;
    int Count = 0;
    int CountTrue = 0;
    int CountFalse = 0;

    TextView text,time,score;
    Button truee,lie,start;
    ProgressBar progressBar;

    int num_quest;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_true_or_false);

        text = (TextView) findViewById(R.id.text);
        time = (TextView) findViewById(R.id.time);
        score = (TextView) findViewById(R.id.score);
        truee = (Button) findViewById(R.id.truee);
        lie = (Button) findViewById(R.id.lie);
        start = (Button) findViewById(R.id.start);
        progressBar = (ProgressBar) findViewById(R.id.progressBar);

        text.setEnabled(false);
        time.setEnabled(false);
        score.setEnabled(false);
        truee.setEnabled(false);
        lie.setEnabled(false);
        progressBar.setEnabled(false);

        truee.setText("Правда");
        lie.setText("Брехня");
        time.setText("Час : 40с");
        start.setText("Почати");
        score.setText("Очки : 0");

        r = new Random();

        truee.setEnabled(false);
        lie.setEnabled(false);

    }

    private void newGame(){
        truee.setEnabled(true);
        lie.setEnabled(true);
        num_quest = r.nextInt(questions.length);
        text.setText(questions[num_quest]);
    }

    public void clickTrue(View view){
        if(truee.getText().toString().equalsIgnoreCase(answers[num_quest])){
            CountTrue++;
            Count++;
            score.setText("Очки : " + + Count);

            newGame();
        } else {
            Count--;
            CountFalse++;
            score.setText("Очки : " + + Count);

            newGame();
        }
    }

    public void clickLie(View view){
        if(lie.getText().toString().equalsIgnoreCase(answers[num_quest])){
            Count++;
            CountTrue++;
            score.setText("Очки : " + + Count);

            newGame();
        } else {
            Count--;
            CountFalse++;
            score.setText("Очки : " + + Count);


            newGame();
        }
    }

    public void startGame(View view){
        text.setEnabled(true);
        time.setEnabled(true);
        score.setEnabled(true);
        truee.setEnabled(true);
        lie.setEnabled(true);
        progressBar.setEnabled(true);

        newGame();
        start.setVisibility(View.GONE);
        StartTime();
    }

    private void StartTime(){
        countDownTimer = new CountDownTimer(timemilliseconds,1000) {
            @Override
            public void onTick(long millisUntilFinished) {
                timemilliseconds = millisUntilFinished;
                i++;
                progressBar.setProgress(i);
                update();
            }

            @Override
            public void onFinish() {
                i++;
                progressBar.setProgress(41);
                truee.setEnabled(true);
                lie.setEnabled(true);
                Handler handler = new Handler();
                handler.postDelayed(new Runnable() {
                    public void run() {
                        Intent intent = new Intent();
                        if (Count > 0) {
                            intent.putExtra("score", Count);
                            intent.putExtra("scoreTrue", CountTrue);
                            intent.putExtra("scoreFalse", CountFalse);
                            //intent.putExtra("flag",true);
                        }
                        else {
                            intent.putExtra("score", 0);
                            intent.putExtra("scoreTrue", CountTrue);
                            intent.putExtra("scoreFalse", CountFalse);
                            //intent.putExtra("flag",true);
                        }
                        intent.putExtra("exit", 1);
                        setResult(RESULT_OK, intent);
                        finish();
                    }}, 700);

            }
        }.start();
    }

    public void update(){
        int seconds = (int)timemilliseconds/1000;
        time.setText("Час : " + seconds);
    }


    @Override
    public void onBackPressed() {
        if (countDownTimer != null)
            countDownTimer.cancel();
        Intent intent = new Intent();
        intent.putExtra("exit", 0);
        setResult(RESULT_OK, intent);
        finish();
        super.onBackPressed();
    }

    public void finish(View view) {
        finish();
    }
}
